LQM2015/stm32/Drivers/aw882xx/product_init_files/AW88266/aw882xx_pid_2013_reg.h
#ifndef __AW_PID_2013_REG_H__
#define __AW_PID_2013_REG_H__

/* registers list */
#define AW_PID_2013_ID_REG		(0x00)
#define AW_PID_2013_SYSST_REG		(0x01)
#define AW_PID_2013_SYSINT_REG		(0x02)
#define AW_PID_2013_SYSINTM_REG		(0x03)
#define AW_PID_2013_SYSCTRL_REG		(0x04)
#define AW_PID_2013_SYSCTRL2_REG	(0x05)
#define AW_PID_2013_I2SCTRL1_REG	(0x06)
#define AW_PID_2013_I2SCTRL2_REG	(0x07)
#define AW_PID_2013_DACCFG1_REG		(0x08)
#define AW_PID_2013_DACCFG2_REG		(0x09)
#define AW_PID_2013_DACCFG3_REG		(0x0A)
#define AW_PID_2013_DACCFG4_REG		(0x0B)
#define AW_PID_2013_DACCFG5_REG		(0x0C)
#define AW_PID_2013_DACCFG6_REG		(0x0D)
#define AW_PID_2013_DACCFG7_REG		(0x0E)
#define AW_PID_2013_PWMCTRL_REG		(0x10)
#define AW_PID_2013_I2SCFG1_REG		(0x11)
#define AW_PID_2013_DBGCTRL_REG		(0x12)
#define AW_PID_2013_DACST_REG		(0x20)
#define AW_PID_2013_VBAT_REG		(0x21)
#define AW_PID_2013_TEMP_REG		(0x22)
#define AW_PID_2013_PVDD_REG		(0x23)
#define AW_PID_2013_ISNDAT_REG		(0x24)
#define AW_PID_2013_VSNDAT_REG		(0x25)
#define AW_PID_2013_I2SINT_REG		(0x26)
#define AW_PID_2013_I2SCAPCNT_REG	(0x27)
#define AW_PID_2013_ANASTA1_REG		(0x28)
#define AW_PID_2013_ANASTA2_REG		(0x29)
#define AW_PID_2013_ANASTA3_REG		(0x2A)
#define AW_PID_2013_TESTDET_REG		(0x2B)
#define AW_PID_2013_TESTIN_REG		(0x38)
#define AW_PID_2013_TESTOUT_REG		(0x39)
#define AW_PID_2013_VSNTM1_REG		(0x50)
#define AW_PID_2013_VSNTM2_REG		(0x51)
#define AW_PID_2013_ISNCTRL1_REG	(0x52)
#define AW_PID_2013_PLLCTRL1_REG	(0x53)
#define AW_PID_2013_PLLCTRL2_REG	(0x54)
#define AW_PID_2013_PLLCTRL3_REG	(0x55)
#define AW_PID_2013_CDACTRL1_REG	(0x56)
#define AW_PID_2013_CDACTRL2_REG	(0x57)
#define AW_PID_2013_SADCCTRL1_REG	(0x58)
#define AW_PID_2013_BSTCTRL1_REG	(0x60)
#define AW_PID_2013_BSTCTRL2_REG	(0x61)
#define AW_PID_2013_BSTCTRL3_REG	(0x62)
#define AW_PID_2013_BSTCTRL4_REG	(0x63)
#define AW_PID_2013_BSTCTRL5_REG	(0x64)
#define AW_PID_2013_BSTCTRL6_REG	(0x65)
#define AW_PID_2013_DSMCFG1_REG		(0x66)
#define AW_PID_2013_DSMCFG2_REG		(0x67)
#define AW_PID_2013_DSMCFG3_REG		(0x68)
#define AW_PID_2013_DSMCFG4_REG		(0x69)
#define AW_PID_2013_DSMCFG5_REG		(0x6A)
#define AW_PID_2013_DSMCFG6_REG		(0x6B)
#define AW_PID_2013_DSMCFG7_REG		(0x6C)
#define AW_PID_2013_DSMCFG8_REG		(0x6D)
#define AW_PID_2013_TESTCTRL1_REG	(0x70)
#define AW_PID_2013_TESTCTRL2_REG	(0x71)
#define AW_PID_2013_EFCTRL1_REG		(0x72)
#define AW_PID_2013_EFCTRL2_REG		(0x73)
#define AW_PID_2013_EFWH_REG		(0x74)
#define AW_PID_2013_EFWM2_REG		(0x75)
#define AW_PID_2013_EFWM1_REG		(0x76)
#define AW_PID_2013_EFWL_REG		(0x77)
#define AW_PID_2013_EFRH_REG		(0x78)
#define AW_PID_2013_EFRM2_REG		(0x79)
#define AW_PID_2013_EFRM1_REG		(0x7A)
#define AW_PID_2013_EFRL_REG		(0x7B)
#define AW_PID_2013_TM_REG		(0x7C)

/********************************************
 * Register Access
 *******************************************/
#define AW_PID_2013_REG_MAX				(0x7D)

#define AW_PID_2013_REG_NONE_ACCESS			(0)
#define AW_PID_2013_REG_RD_ACCESS			(1 << 0)
#define AW_PID_2013_REG_WR_ACCESS			(1 << 1)

const unsigned char aw_pid_2013_reg_access[AW_PID_2013_REG_MAX] = {
	[AW_PID_2013_ID_REG]		= (AW_PID_2013_REG_RD_ACCESS),
	[AW_PID_2013_SYSST_REG] 	= (AW_PID_2013_REG_RD_ACCESS),
	[AW_PID_2013_SYSINT_REG]	= (AW_PID_2013_REG_RD_ACCESS),
	[AW_PID_2013_SYSINTM_REG]	= (AW_PID_2013_REG_RD_ACCESS | AW_PID_2013_REG_WR_ACCESS),
	[AW_PID_2013_SYSCTRL_REG]	= (AW_PID_2013_REG_RD_ACCESS | AW_PID_2013_REG_WR_ACCESS),
	[AW_PID_2013_SYSCTRL2_REG]	= (AW_PID_2013_REG_RD_ACCESS | AW_PID_2013_REG_WR_ACCESS),
	[AW_PID_2013_I2SCTRL1_REG]	= (AW_PID_2013_REG_RD_ACCESS | AW_PID_2013_REG_WR_ACCESS),
	[AW_PID_2013_I2SCTRL2_REG]	= (AW_PID_2013_REG_RD_ACCESS | AW_PID_2013_REG_WR_ACCESS),
	[AW_PID_2013_DACCFG1_REG]	= (AW_PID_2013_REG_RD_ACCESS | AW_PID_2013_REG_WR_ACCESS),
	[AW_PID_2013_DACCFG2_REG]	= (AW_PID_2013_REG_RD_ACCESS | AW_PID_2013_REG_WR_ACCESS),
	[AW_PID_2013_DACCFG3_REG]	= (AW_PID_2013_REG_RD_ACCESS | AW_PID_2013_REG_WR_ACCESS),
	[AW_PID_2013_DACCFG4_REG]	= (AW_PID_2013_REG_RD_ACCESS | AW_PID_2013_REG_WR_ACCESS),
	[AW_PID_2013_DACCFG5_REG]	= (AW_PID_2013_REG_RD_ACCESS | AW_PID_2013_REG_WR_ACCESS),
	[AW_PID_2013_DACCFG6_REG]	= (AW_PID_2013_REG_RD_ACCESS | AW_PID_2013_REG_WR_ACCESS),
	[AW_PID_2013_DACCFG7_REG]	= (AW_PID_2013_REG_RD_ACCESS | AW_PID_2013_REG_WR_ACCESS),
	[AW_PID_2013_PWMCTRL_REG]	= (AW_PID_2013_REG_RD_ACCESS | AW_PID_2013_REG_WR_ACCESS),
	[AW_PID_2013_I2SCFG1_REG]	= (AW_PID_2013_REG_RD_ACCESS | AW_PID_2013_REG_WR_ACCESS),
	[AW_PID_2013_DBGCTRL_REG]	= (AW_PID_2013_REG_RD_ACCESS | AW_PID_2013_REG_WR_ACCESS),
	[AW_PID_2013_DACST_REG] 	= (AW_PID_2013_REG_RD_ACCESS),
	[AW_PID_2013_VBAT_REG]		= (AW_PID_2013_REG_RD_ACCESS),
	[AW_PID_2013_TEMP_REG]		= (AW_PID_2013_REG_RD_ACCESS),
	[AW_PID_2013_PVDD_REG]		= (AW_PID_2013_REG_RD_ACCESS),
	[AW_PID_2013_ISNDAT_REG]	= (AW_PID_2013_REG_RD_ACCESS),
	[AW_PID_2013_VSNDAT_REG]	= (AW_PID_2013_REG_RD_ACCESS),
	[AW_PID_2013_I2SINT_REG]	= (AW_PID_2013_REG_RD_ACCESS),
	[AW_PID_2013_I2SCAPCNT_REG]	= (AW_PID_2013_REG_RD_ACCESS),
	[AW_PID_2013_ANASTA1_REG]	= (AW_PID_2013_REG_RD_ACCESS),
	[AW_PID_2013_ANASTA2_REG]	= (AW_PID_2013_REG_RD_ACCESS),
	[AW_PID_2013_ANASTA3_REG]	= (AW_PID_2013_REG_RD_ACCESS),
	[AW_PID_2013_TESTDET_REG]	= (AW_PID_2013_REG_RD_ACCESS),
	[AW_PID_2013_TESTIN_REG]	= (AW_PID_2013_REG_RD_ACCESS | AW_PID_2013_REG_WR_ACCESS),
	[AW_PID_2013_TESTOUT_REG]	= (AW_PID_2013_REG_RD_ACCESS),
	[AW_PID_2013_VSNTM1_REG]	= (AW_PID_2013_REG_RD_ACCESS | AW_PID_2013_REG_WR_ACCESS),
	[AW_PID_2013_VSNTM2_REG]	= (AW_PID_2013_REG_RD_ACCESS | AW_PID_2013_REG_WR_ACCESS),
	[AW_PID_2013_ISNCTRL1_REG]	= (AW_PID_2013_REG_RD_ACCESS | AW_PID_2013_REG_WR_ACCESS),
	[AW_PID_2013_PLLCTRL1_REG]	= (AW_PID_2013_REG_RD_ACCESS | AW_PID_2013_REG_WR_ACCESS),
	[AW_PID_2013_PLLCTRL2_REG]	= (AW_PID_2013_REG_RD_ACCESS | AW_PID_2013_REG_WR_ACCESS),
	[AW_PID_2013_PLLCTRL3_REG]	= (AW_PID_2013_REG_RD_ACCESS | AW_PID_2013_REG_WR_ACCESS),
	[AW_PID_2013_CDACTRL1_REG]	= (AW_PID_2013_REG_RD_ACCESS | AW_PID_2013_REG_WR_ACCESS),
	[AW_PID_2013_CDACTRL2_REG]	= (AW_PID_2013_REG_RD_ACCESS | AW_PID_2013_REG_WR_ACCESS),
	[AW_PID_2013_SADCCTRL1_REG]	= (AW_PID_2013_REG_RD_ACCESS | AW_PID_2013_REG_WR_ACCESS),
	[AW_PID_2013_BSTCTRL1_REG]	= (AW_PID_2013_REG_RD_ACCESS | AW_PID_2013_REG_WR_ACCESS),
	[AW_PID_2013_BSTCTRL2_REG]	= (AW_PID_2013_REG_RD_ACCESS | AW_PID_2013_REG_WR_ACCESS),
	[AW_PID_2013_BSTCTRL3_REG]	= (AW_PID_2013_REG_RD_ACCESS | AW_PID_2013_REG_WR_ACCESS),
	[AW_PID_2013_BSTCTRL4_REG]	= (AW_PID_2013_REG_RD_ACCESS | AW_PID_2013_REG_WR_ACCESS),
	[AW_PID_2013_BSTCTRL5_REG]	= (AW_PID_2013_REG_RD_ACCESS | AW_PID_2013_REG_WR_ACCESS),
	[AW_PID_2013_BSTCTRL6_REG]	= (AW_PID_2013_REG_RD_ACCESS | AW_PID_2013_REG_WR_ACCESS),
	[AW_PID_2013_DSMCFG1_REG]	= (AW_PID_2013_REG_RD_ACCESS | AW_PID_2013_REG_WR_ACCESS),
	[AW_PID_2013_DSMCFG2_REG]	= (AW_PID_2013_REG_RD_ACCESS | AW_PID_2013_REG_WR_ACCESS),
	[AW_PID_2013_DSMCFG3_REG]	= (AW_PID_2013_REG_RD_ACCESS | AW_PID_2013_REG_WR_ACCESS),
	[AW_PID_2013_DSMCFG4_REG]	= (AW_PID_2013_REG_RD_ACCESS | AW_PID_2013_REG_WR_ACCESS),
	[AW_PID_2013_DSMCFG5_REG]	= (AW_PID_2013_REG_RD_ACCESS | AW_PID_2013_REG_WR_ACCESS),
	[AW_PID_2013_DSMCFG6_REG]	= (AW_PID_2013_REG_RD_ACCESS | AW_PID_2013_REG_WR_ACCESS),
	[AW_PID_2013_DSMCFG7_REG]	= (AW_PID_2013_REG_RD_ACCESS | AW_PID_2013_REG_WR_ACCESS),
	[AW_PID_2013_DSMCFG8_REG]	= (AW_PID_2013_REG_RD_ACCESS | AW_PID_2013_REG_WR_ACCESS),
	[AW_PID_2013_TESTCTRL1_REG]	= (AW_PID_2013_REG_RD_ACCESS | AW_PID_2013_REG_WR_ACCESS),
	[AW_PID_2013_TESTCTRL2_REG]	= (AW_PID_2013_REG_RD_ACCESS | AW_PID_2013_REG_WR_ACCESS),
	[AW_PID_2013_EFCTRL1_REG]	= (AW_PID_2013_REG_RD_ACCESS | AW_PID_2013_REG_WR_ACCESS),
	[AW_PID_2013_EFCTRL2_REG]	= (AW_PID_2013_REG_RD_ACCESS | AW_PID_2013_REG_WR_ACCESS),
	[AW_PID_2013_EFWH_REG]		= (AW_PID_2013_REG_RD_ACCESS | AW_PID_2013_REG_WR_ACCESS),
	[AW_PID_2013_EFWM2_REG] 	= (AW_PID_2013_REG_RD_ACCESS | AW_PID_2013_REG_WR_ACCESS),
	[AW_PID_2013_EFWM1_REG] 	= (AW_PID_2013_REG_RD_ACCESS | AW_PID_2013_REG_WR_ACCESS),
	[AW_PID_2013_EFWL_REG]		= (AW_PID_2013_REG_RD_ACCESS | AW_PID_2013_REG_WR_ACCESS),
	[AW_PID_2013_EFRH_REG]		= (AW_PID_2013_REG_RD_ACCESS),
	[AW_PID_2013_EFRM2_REG] 	= (AW_PID_2013_REG_RD_ACCESS),
	[AW_PID_2013_EFRM1_REG] 	= (AW_PID_2013_REG_RD_ACCESS),
	[AW_PID_2013_EFRL_REG]		= (AW_PID_2013_REG_RD_ACCESS),
	[AW_PID_2013_TM_REG]		= (AW_PID_2013_REG_NONE_ACCESS),
};

/* detail information of registers begin */
/* ID (0x00) detail */
/* IDCODE bit 15:0 (ID 0x00) */
#define AW_PID_2013_IDCODE_START_BIT	(0)
#define AW_PID_2013_IDCODE_BITS_LEN	(16)
#define AW_PID_2013_IDCODE_MASK	\
	(~(((1<<AW_PID_2013_IDCODE_BITS_LEN)-1) << AW_PID_2013_IDCODE_START_BIT))

