LQM2015/stm32/Drivers/aw882xx/product_init_files/AW88266/aw882xx_pid_2013_reg.h
#define AW_PID_2013_UVL_DVDDS_UVLO	(1)
#define AW_PID_2013_UVL_DVDDS_UVLO_VALUE	\
	(AW_PID_2013_UVL_DVDDS_UVLO << AW_PID_2013_UVL_DVDDS_START_BIT)

#define AW_PID_2013_UVL_DVDDS_DEFAULT_VALUE	(0)
#define AW_PID_2013_UVL_DVDDS_DEFAULT	\
	(AW_PID_2013_UVL_DVDDS_DEFAULT_VALUE << AW_PID_2013_UVL_DVDDS_START_BIT)

/* OTHS bit 1 (SYSST 0x01) */
#define AW_PID_2013_OTHS_START_BIT	(1)
#define AW_PID_2013_OTHS_BITS_LEN	(1)
#define AW_PID_2013_OTHS_MASK	\
	(~(((1<<AW_PID_2013_OTHS_BITS_LEN)-1) << AW_PID_2013_OTHS_START_BIT))

#define AW_PID_2013_OTHS_NORMAL	(0)
#define AW_PID_2013_OTHS_NORMAL_VALUE	\
	(AW_PID_2013_OTHS_NORMAL << AW_PID_2013_OTHS_START_BIT)

#define AW_PID_2013_OTHS_OT	(1)
#define AW_PID_2013_OTHS_OT_VALUE	\
	(AW_PID_2013_OTHS_OT << AW_PID_2013_OTHS_START_BIT)

#define AW_PID_2013_OTHS_DEFAULT_VALUE	(0)
#define AW_PID_2013_OTHS_DEFAULT	\
	(AW_PID_2013_OTHS_DEFAULT_VALUE << AW_PID_2013_OTHS_START_BIT)

/* PLLS bit 0 (SYSST 0x01) */
#define AW_PID_2013_PLLS_START_BIT	(0)
#define AW_PID_2013_PLLS_BITS_LEN	(1)
#define AW_PID_2013_PLLS_MASK	\
	(~(((1<<AW_PID_2013_PLLS_BITS_LEN)-1) << AW_PID_2013_PLLS_START_BIT))

#define AW_PID_2013_PLLS_UNLOCKED	(0)
#define AW_PID_2013_PLLS_UNLOCKED_VALUE	\
	(AW_PID_2013_PLLS_UNLOCKED << AW_PID_2013_PLLS_START_BIT)

#define AW_PID_2013_PLLS_LOCKED	(1)
#define AW_PID_2013_PLLS_LOCKED_VALUE	\
	(AW_PID_2013_PLLS_LOCKED << AW_PID_2013_PLLS_START_BIT)

#define AW_PID_2013_PLLS_DEFAULT_VALUE	(0)
#define AW_PID_2013_PLLS_DEFAULT	\
	(AW_PID_2013_PLLS_DEFAULT_VALUE << AW_PID_2013_PLLS_START_BIT)

#define AW_PID_2013_SYSST_CHECK_MASK \
	(~(AW_PID_2013_UVLS_UVLO_VALUE | \
	AW_PID_2013_BSTOCS_OVER_CURRENT_VALUE | \
	AW_PID_2013_BSTS_FINISHED_VALUE | \
	AW_PID_2013_SWS_SWITCHING_VALUE | \
	AW_PID_2013_NOCLKS_NO_CLOCK_VALUE | \
	AW_PID_2013_CLKS_STABLE_VALUE | \
	AW_PID_2013_OCDS_OC_VALUE | \
	AW_PID_2013_OTHS_OT_VALUE | \
	AW_PID_2013_PLLS_LOCKED_VALUE))

#define AW_PID_2013_SYSST_CHECK \
	(AW_PID_2013_BSTS_FINISHED_VALUE | \
	AW_PID_2013_SWS_SWITCHING_VALUE | \
	AW_PID_2013_CLKS_STABLE_VALUE | \
	AW_PID_2013_PLLS_LOCKED_VALUE)

/* default value of SYSST (0x01) */
/* #define AW_PID_2013_SYSST_DEFAULT		(0x0000) */

/* SYSINT (0x02) detail */
/* OVP2I bit 15 (SYSINT 0x02) */
#define AW_PID_2013_OVP2I_START_BIT	(15)
#define AW_PID_2013_OVP2I_BITS_LEN	(1)
#define AW_PID_2013_OVP2I_MASK	\
	(~(((1<<AW_PID_2013_OVP2I_BITS_LEN)-1) << AW_PID_2013_OVP2I_START_BIT))

#define AW_PID_2013_OVP2I_DEFAULT_VALUE	(0)
#define AW_PID_2013_OVP2I_DEFAULT	\
	(AW_PID_2013_OVP2I_DEFAULT_VALUE << AW_PID_2013_OVP2I_START_BIT)

/* UVLI bit 14 (SYSINT 0x02) */
#define AW_PID_2013_UVLI_START_BIT	(14)
#define AW_PID_2013_UVLI_BITS_LEN	(1)
#define AW_PID_2013_UVLI_MASK	\
	(~(((1<<AW_PID_2013_UVLI_BITS_LEN)-1) << AW_PID_2013_UVLI_START_BIT))

#define AW_PID_2013_UVLI_DEFAULT_VALUE	(0)
#define AW_PID_2013_UVLI_DEFAULT	\
	(AW_PID_2013_UVLI_DEFAULT_VALUE << AW_PID_2013_UVLI_START_BIT)

/* ADPI bit 13 (SYSINT 0x02) */
#define AW_PID_2013_ADPI_START_BIT	(13)
#define AW_PID_2013_ADPI_BITS_LEN	(1)
#define AW_PID_2013_ADPI_MASK	\
	(~(((1<<AW_PID_2013_ADPI_BITS_LEN)-1) << AW_PID_2013_ADPI_START_BIT))

#define AW_PID_2013_ADPI_DEFAULT_VALUE	(0)
#define AW_PID_2013_ADPI_DEFAULT	\
	(AW_PID_2013_ADPI_DEFAULT_VALUE << AW_PID_2013_ADPI_START_BIT)

/* BSTOCI bit 11 (SYSINT 0x02) */
#define AW_PID_2013_BSTOCI_START_BIT	(11)
#define AW_PID_2013_BSTOCI_BITS_LEN	(1)
#define AW_PID_2013_BSTOCI_MASK	\
	(~(((1<<AW_PID_2013_BSTOCI_BITS_LEN)-1) << AW_PID_2013_BSTOCI_START_BIT))

#define AW_PID_2013_BSTOCI_DEFAULT_VALUE	(0)
#define AW_PID_2013_BSTOCI_DEFAULT	\
	(AW_PID_2013_BSTOCI_DEFAULT_VALUE << AW_PID_2013_BSTOCI_START_BIT)

/* OVPI bit 10 (SYSINT 0x02) */
#define AW_PID_2013_OVPI_START_BIT	(10)
#define AW_PID_2013_OVPI_BITS_LEN	(1)
#define AW_PID_2013_OVPI_MASK	\
	(~(((1<<AW_PID_2013_OVPI_BITS_LEN)-1) << AW_PID_2013_OVPI_START_BIT))

#define AW_PID_2013_OVPI_DEFAULT_VALUE	(0)
#define AW_PID_2013_OVPI_DEFAULT	\
	(AW_PID_2013_OVPI_DEFAULT_VALUE << AW_PID_2013_OVPI_START_BIT)

/* BSTI bit 9 (SYSINT 0x02) */
#define AW_PID_2013_BSTI_START_BIT	(9)
#define AW_PID_2013_BSTI_BITS_LEN	(1)
#define AW_PID_2013_BSTI_MASK	\
	(~(((1<<AW_PID_2013_BSTI_BITS_LEN)-1) << AW_PID_2013_BSTI_START_BIT))

#define AW_PID_2013_BSTI_DEFAULT_VALUE	(0)
#define AW_PID_2013_BSTI_DEFAULT	\
	(AW_PID_2013_BSTI_DEFAULT_VALUE << AW_PID_2013_BSTI_START_BIT)

/* SWI bit 8 (SYSINT 0x02) */
#define AW_PID_2013_SWI_START_BIT	(8)
#define AW_PID_2013_SWI_BITS_LEN	(1)
#define AW_PID_2013_SWI_MASK	\
	(~(((1<<AW_PID_2013_SWI_BITS_LEN)-1) << AW_PID_2013_SWI_START_BIT))

#define AW_PID_2013_SWI_DEFAULT_VALUE	(0)
#define AW_PID_2013_SWI_DEFAULT	\
	(AW_PID_2013_SWI_DEFAULT_VALUE << AW_PID_2013_SWI_START_BIT)

/* NOCLKI bit 5 (SYSINT 0x02) */
#define AW_PID_2013_NOCLKI_START_BIT	(5)
#define AW_PID_2013_NOCLKI_BITS_LEN	(1)
#define AW_PID_2013_NOCLKI_MASK	\
	(~(((1<<AW_PID_2013_NOCLKI_BITS_LEN)-1) << AW_PID_2013_NOCLKI_START_BIT))

#define AW_PID_2013_NOCLKI_DEFAULT_VALUE	(0)
#define AW_PID_2013_NOCLKI_DEFAULT	\
	(AW_PID_2013_NOCLKI_DEFAULT_VALUE << AW_PID_2013_NOCLKI_START_BIT)

/* CLKI bit 4 (SYSINT 0x02) */
#define AW_PID_2013_CLKI_START_BIT	(4)
#define AW_PID_2013_CLKI_BITS_LEN	(1)
#define AW_PID_2013_CLKI_MASK	\
	(~(((1<<AW_PID_2013_CLKI_BITS_LEN)-1) << AW_PID_2013_CLKI_START_BIT))

#define AW_PID_2013_CLKI_DEFAULT_VALUE	(0)
#define AW_PID_2013_CLKI_DEFAULT	\
	(AW_PID_2013_CLKI_DEFAULT_VALUE << AW_PID_2013_CLKI_START_BIT)

/* OCDI bit 3 (SYSINT 0x02) */
#define AW_PID_2013_OCDI_START_BIT	(3)
#define AW_PID_2013_OCDI_BITS_LEN	(1)
#define AW_PID_2013_OCDI_MASK	\
	(~(((1<<AW_PID_2013_OCDI_BITS_LEN)-1) << AW_PID_2013_OCDI_START_BIT))

#define AW_PID_2013_OCDI_DEFAULT_VALUE	(0)
#define AW_PID_2013_OCDI_DEFAULT	\
	(AW_PID_2013_OCDI_DEFAULT_VALUE << AW_PID_2013_OCDI_START_BIT)

/* UVL_DVDDI bit 2 (SYSINT 0x02) */
#define AW_PID_2013_UVL_DVDDI_START_BIT	(2)
#define AW_PID_2013_UVL_DVDDI_BITS_LEN	(1)
#define AW_PID_2013_UVL_DVDDI_MASK	\
	(~(((1<<AW_PID_2013_UVL_DVDDI_BITS_LEN)-1) << AW_PID_2013_UVL_DVDDI_START_BIT))

#define AW_PID_2013_UVL_DVDDI_DEFAULT_VALUE	(0)
#define AW_PID_2013_UVL_DVDDI_DEFAULT	\
	(AW_PID_2013_UVL_DVDDI_DEFAULT_VALUE << AW_PID_2013_UVL_DVDDI_START_BIT)

/* OTHI bit 1 (SYSINT 0x02) */
#define AW_PID_2013_OTHI_START_BIT	(1)
#define AW_PID_2013_OTHI_BITS_LEN	(1)
#define AW_PID_2013_OTHI_MASK	\
	(~(((1<<AW_PID_2013_OTHI_BITS_LEN)-1) << AW_PID_2013_OTHI_START_BIT))

#define AW_PID_2013_OTHI_DEFAULT_VALUE	(0)
#define AW_PID_2013_OTHI_DEFAULT	\
	(AW_PID_2013_OTHI_DEFAULT_VALUE << AW_PID_2013_OTHI_START_BIT)

/* PLLI bit 0 (SYSINT 0x02) */
#define AW_PID_2013_PLLI_START_BIT	(0)
#define AW_PID_2013_PLLI_BITS_LEN	(1)
#define AW_PID_2013_PLLI_MASK	\
	(~(((1<<AW_PID_2013_PLLI_BITS_LEN)-1) << AW_PID_2013_PLLI_START_BIT))

#define AW_PID_2013_PLLI_DEFAULT_VALUE	(0)
#define AW_PID_2013_PLLI_DEFAULT	\
	(AW_PID_2013_PLLI_DEFAULT_VALUE << AW_PID_2013_PLLI_START_BIT)

/* default value of SYSINT (0x02) */
/* #define AW_PID_2013_SYSINT_DEFAULT		(0x0000) */

/* SYSINTM (0x03) detail */
/* OVP2M bit 15 (SYSINTM 0x03) */
#define AW_PID_2013_OVP2M_START_BIT	(15)
#define AW_PID_2013_OVP2M_BITS_LEN	(1)
#define AW_PID_2013_OVP2M_MASK	\
	(~(((1<<AW_PID_2013_OVP2M_BITS_LEN)-1) << AW_PID_2013_OVP2M_START_BIT))

