LQM2015/stm32/Drivers/aw882xx/product_init_files/AW88266/aw882xx_pid_2013_reg.h
#define AW_PID_2013_OVP2M_DEFAULT_VALUE	(1)
#define AW_PID_2013_OVP2M_DEFAULT	\
	(AW_PID_2013_OVP2M_DEFAULT_VALUE << AW_PID_2013_OVP2M_START_BIT)

/* UVLM bit 14 (SYSINTM 0x03) */
#define AW_PID_2013_UVLM_START_BIT	(14)
#define AW_PID_2013_UVLM_BITS_LEN	(1)
#define AW_PID_2013_UVLM_MASK	\
	(~(((1<<AW_PID_2013_UVLM_BITS_LEN)-1) << AW_PID_2013_UVLM_START_BIT))

#define AW_PID_2013_UVLM_DEFAULT_VALUE	(1)
#define AW_PID_2013_UVLM_DEFAULT	\
	(AW_PID_2013_UVLM_DEFAULT_VALUE << AW_PID_2013_UVLM_START_BIT)

/* ADPM bit 13 (SYSINTM 0x03) */
#define AW_PID_2013_ADPM_START_BIT	(13)
#define AW_PID_2013_ADPM_BITS_LEN	(1)
#define AW_PID_2013_ADPM_MASK	\
	(~(((1<<AW_PID_2013_ADPM_BITS_LEN)-1) << AW_PID_2013_ADPM_START_BIT))

#define AW_PID_2013_ADPM_DEFAULT_VALUE	(1)
#define AW_PID_2013_ADPM_DEFAULT	\
	(AW_PID_2013_ADPM_DEFAULT_VALUE << AW_PID_2013_ADPM_START_BIT)

/* DSPM bit 12 (SYSINTM 0x03) */
#define AW_PID_2013_DSPM_START_BIT	(12)
#define AW_PID_2013_DSPM_BITS_LEN	(1)
#define AW_PID_2013_DSPM_MASK	\
	(~(((1<<AW_PID_2013_DSPM_BITS_LEN)-1) << AW_PID_2013_DSPM_START_BIT))

#define AW_PID_2013_DSPM_DEFAULT_VALUE	(1)
#define AW_PID_2013_DSPM_DEFAULT	\
	(AW_PID_2013_DSPM_DEFAULT_VALUE << AW_PID_2013_DSPM_START_BIT)

/* BSTOCM bit 11 (SYSINTM 0x03) */
#define AW_PID_2013_BSTOCM_START_BIT	(11)
#define AW_PID_2013_BSTOCM_BITS_LEN	(1)
#define AW_PID_2013_BSTOCM_MASK	\
	(~(((1<<AW_PID_2013_BSTOCM_BITS_LEN)-1) << AW_PID_2013_BSTOCM_START_BIT))

#define AW_PID_2013_BSTOCM_DEFAULT_VALUE	(1)
#define AW_PID_2013_BSTOCM_DEFAULT	\
	(AW_PID_2013_BSTOCM_DEFAULT_VALUE << AW_PID_2013_BSTOCM_START_BIT)

/* OVPM bit 10 (SYSINTM 0x03) */
#define AW_PID_2013_OVPM_START_BIT	(10)
#define AW_PID_2013_OVPM_BITS_LEN	(1)
#define AW_PID_2013_OVPM_MASK	\
	(~(((1<<AW_PID_2013_OVPM_BITS_LEN)-1) << AW_PID_2013_OVPM_START_BIT))

#define AW_PID_2013_OVPM_DEFAULT_VALUE	(1)
#define AW_PID_2013_OVPM_DEFAULT	\
	(AW_PID_2013_OVPM_DEFAULT_VALUE << AW_PID_2013_OVPM_START_BIT)

/* BSTM bit 9 (SYSINTM 0x03) */
#define AW_PID_2013_BSTM_START_BIT	(9)
#define AW_PID_2013_BSTM_BITS_LEN	(1)
#define AW_PID_2013_BSTM_MASK	\
	(~(((1<<AW_PID_2013_BSTM_BITS_LEN)-1) << AW_PID_2013_BSTM_START_BIT))

#define AW_PID_2013_BSTM_DEFAULT_VALUE	(1)
#define AW_PID_2013_BSTM_DEFAULT	\
	(AW_PID_2013_BSTM_DEFAULT_VALUE << AW_PID_2013_BSTM_START_BIT)

/* SWM bit 8 (SYSINTM 0x03) */
#define AW_PID_2013_SWM_START_BIT	(8)
#define AW_PID_2013_SWM_BITS_LEN	(1)
#define AW_PID_2013_SWM_MASK	\
	(~(((1<<AW_PID_2013_SWM_BITS_LEN)-1) << AW_PID_2013_SWM_START_BIT))

#define AW_PID_2013_SWM_DEFAULT_VALUE	(1)
#define AW_PID_2013_SWM_DEFAULT	\
	(AW_PID_2013_SWM_DEFAULT_VALUE << AW_PID_2013_SWM_START_BIT)

/* CLIPM bit 7 (SYSINTM 0x03) */
#define AW_PID_2013_CLIPM_START_BIT	(7)
#define AW_PID_2013_CLIPM_BITS_LEN	(1)
#define AW_PID_2013_CLIPM_MASK	\
	(~(((1<<AW_PID_2013_CLIPM_BITS_LEN)-1) << AW_PID_2013_CLIPM_START_BIT))

#define AW_PID_2013_CLIPM_DEFAULT_VALUE	(1)
#define AW_PID_2013_CLIPM_DEFAULT	\
	(AW_PID_2013_CLIPM_DEFAULT_VALUE << AW_PID_2013_CLIPM_START_BIT)

/* WDM bit 6 (SYSINTM 0x03) */
#define AW_PID_2013_WDM_START_BIT	(6)
#define AW_PID_2013_WDM_BITS_LEN	(1)
#define AW_PID_2013_WDM_MASK	\
	(~(((1<<AW_PID_2013_WDM_BITS_LEN)-1) << AW_PID_2013_WDM_START_BIT))

#define AW_PID_2013_WDM_DEFAULT_VALUE	(1)
#define AW_PID_2013_WDM_DEFAULT	\
	(AW_PID_2013_WDM_DEFAULT_VALUE << AW_PID_2013_WDM_START_BIT)

/* NOCLKM bit 5 (SYSINTM 0x03) */
#define AW_PID_2013_NOCLKM_START_BIT	(5)
#define AW_PID_2013_NOCLKM_BITS_LEN	(1)
#define AW_PID_2013_NOCLKM_MASK	\
	(~(((1<<AW_PID_2013_NOCLKM_BITS_LEN)-1) << AW_PID_2013_NOCLKM_START_BIT))

#define AW_PID_2013_NOCLKM_DEFAULT_VALUE	(1)
#define AW_PID_2013_NOCLKM_DEFAULT	\
	(AW_PID_2013_NOCLKM_DEFAULT_VALUE << AW_PID_2013_NOCLKM_START_BIT)

/* CLKM bit 4 (SYSINTM 0x03) */
#define AW_PID_2013_CLKM_START_BIT	(4)
#define AW_PID_2013_CLKM_BITS_LEN	(1)
#define AW_PID_2013_CLKM_MASK	\
	(~(((1<<AW_PID_2013_CLKM_BITS_LEN)-1) << AW_PID_2013_CLKM_START_BIT))

#define AW_PID_2013_CLKM_DEFAULT_VALUE	(1)
#define AW_PID_2013_CLKM_DEFAULT	\
	(AW_PID_2013_CLKM_DEFAULT_VALUE << AW_PID_2013_CLKM_START_BIT)

/* OCDM bit 3 (SYSINTM 0x03) */
#define AW_PID_2013_OCDM_START_BIT	(3)
#define AW_PID_2013_OCDM_BITS_LEN	(1)
#define AW_PID_2013_OCDM_MASK	\
	(~(((1<<AW_PID_2013_OCDM_BITS_LEN)-1) << AW_PID_2013_OCDM_START_BIT))

#define AW_PID_2013_OCDM_DEFAULT_VALUE	(1)
#define AW_PID_2013_OCDM_DEFAULT	\
	(AW_PID_2013_OCDM_DEFAULT_VALUE << AW_PID_2013_OCDM_START_BIT)

/* UVL_DVDDM bit 2 (SYSINTM 0x03) */
#define AW_PID_2013_UVL_DVDDM_START_BIT	(2)
#define AW_PID_2013_UVL_DVDDM_BITS_LEN	(1)
#define AW_PID_2013_UVL_DVDDM_MASK	\
	(~(((1<<AW_PID_2013_UVL_DVDDM_BITS_LEN)-1) << AW_PID_2013_UVL_DVDDM_START_BIT))

#define AW_PID_2013_UVL_DVDDM_DEFAULT_VALUE	(1)
#define AW_PID_2013_UVL_DVDDM_DEFAULT	\
	(AW_PID_2013_UVL_DVDDM_DEFAULT_VALUE << AW_PID_2013_UVL_DVDDM_START_BIT)

/* OTHM bit 1 (SYSINTM 0x03) */
#define AW_PID_2013_OTHM_START_BIT	(1)
#define AW_PID_2013_OTHM_BITS_LEN	(1)
#define AW_PID_2013_OTHM_MASK	\
	(~(((1<<AW_PID_2013_OTHM_BITS_LEN)-1) << AW_PID_2013_OTHM_START_BIT))

#define AW_PID_2013_OTHM_DEFAULT_VALUE	(1)
#define AW_PID_2013_OTHM_DEFAULT	\
	(AW_PID_2013_OTHM_DEFAULT_VALUE << AW_PID_2013_OTHM_START_BIT)

/* PLLM bit 0 (SYSINTM 0x03) */
#define AW_PID_2013_PLLM_START_BIT	(0)
#define AW_PID_2013_PLLM_BITS_LEN	(1)
#define AW_PID_2013_PLLM_MASK	\
	(~(((1<<AW_PID_2013_PLLM_BITS_LEN)-1) << AW_PID_2013_PLLM_START_BIT))

#define AW_PID_2013_PLLM_DEFAULT_VALUE	(1)
#define AW_PID_2013_PLLM_DEFAULT	\
	(AW_PID_2013_PLLM_DEFAULT_VALUE << AW_PID_2013_PLLM_START_BIT)

/* default value of SYSINTM (0x03) */
#define AW_PID_2013_SYSINTM_DEFAULT		(0xFFFF)

/* SYSCTRL (0x04) detail */
/* DRVSTREN bit 15 (SYSCTRL 0x04) */
#define AW_PID_2013_DRVSTREN_START_BIT	(15)
#define AW_PID_2013_DRVSTREN_BITS_LEN	(1)
#define AW_PID_2013_DRVSTREN_MASK	\
	(~(((1<<AW_PID_2013_DRVSTREN_BITS_LEN)-1) << AW_PID_2013_DRVSTREN_START_BIT))

#define AW_PID_2013_DRVSTREN_4MA	(0)
#define AW_PID_2013_DRVSTREN_4MA_VALUE	\
	(AW_PID_2013_DRVSTREN_4MA << AW_PID_2013_DRVSTREN_START_BIT)

#define AW_PID_2013_DRVSTREN_12MA	(1)
#define AW_PID_2013_DRVSTREN_12MA_VALUE	\
	(AW_PID_2013_DRVSTREN_12MA << AW_PID_2013_DRVSTREN_START_BIT)

#define AW_PID_2013_DRVSTREN_DEFAULT_VALUE	(1)
#define AW_PID_2013_DRVSTREN_DEFAULT	\
	(AW_PID_2013_DRVSTREN_DEFAULT_VALUE << AW_PID_2013_DRVSTREN_START_BIT)

/* SET_GAIN bit 14:12 (SYSCTRL 0x04) */
#define AW_PID_2013_SET_GAIN_START_BIT	(12)
#define AW_PID_2013_SET_GAIN_BITS_LEN	(3)
#define AW_PID_2013_SET_GAIN_MASK	\
	(~(((1<<AW_PID_2013_SET_GAIN_BITS_LEN)-1) << AW_PID_2013_SET_GAIN_START_BIT))

#define AW_PID_2013_SET_GAIN_4P5_AV	(0)
#define AW_PID_2013_SET_GAIN_4P5_AV_VALUE	\
	(AW_PID_2013_SET_GAIN_4P5_AV << AW_PID_2013_SET_GAIN_START_BIT)

#define AW_PID_2013_SET_GAIN_5P0_AV	(1)
#define AW_PID_2013_SET_GAIN_5P0_AV_VALUE	\
	(AW_PID_2013_SET_GAIN_5P0_AV << AW_PID_2013_SET_GAIN_START_BIT)

#define AW_PID_2013_SET_GAIN_6P0_AV	(2)
#define AW_PID_2013_SET_GAIN_6P0_AV_VALUE	\
	(AW_PID_2013_SET_GAIN_6P0_AV << AW_PID_2013_SET_GAIN_START_BIT)

#define AW_PID_2013_SET_GAIN_6P7_AV	(3)
#define AW_PID_2013_SET_GAIN_6P7_AV_VALUE	\
	(AW_PID_2013_SET_GAIN_6P7_AV << AW_PID_2013_SET_GAIN_START_BIT)

#define AW_PID_2013_SET_GAIN_10_AV	(4)
#define AW_PID_2013_SET_GAIN_10_AV_VALUE	\
	(AW_PID_2013_SET_GAIN_10_AV << AW_PID_2013_SET_GAIN_START_BIT)

#define AW_PID_2013_SET_GAIN_12_AV	(5)
#define AW_PID_2013_SET_GAIN_12_AV_VALUE	\
	(AW_PID_2013_SET_GAIN_12_AV << AW_PID_2013_SET_GAIN_START_BIT)

#define AW_PID_2013_SET_GAIN_DEFAULT_VALUE	(0x5)
#define AW_PID_2013_SET_GAIN_DEFAULT	\
	(AW_PID_2013_SET_GAIN_DEFAULT_VALUE << AW_PID_2013_SET_GAIN_START_BIT)

/* RMSE bit 11 (SYSCTRL 0x04) */
#define AW_PID_2013_RMSE_START_BIT	(11)
#define AW_PID_2013_RMSE_BITS_LEN	(1)
#define AW_PID_2013_RMSE_MASK	\
	(~(((1<<AW_PID_2013_RMSE_BITS_LEN)-1) << AW_PID_2013_RMSE_START_BIT))

#define AW_PID_2013_RMSE_PEAK_AGC	(0)
#define AW_PID_2013_RMSE_PEAK_AGC_VALUE	\
	(AW_PID_2013_RMSE_PEAK_AGC << AW_PID_2013_RMSE_START_BIT)

#define AW_PID_2013_RMSE_RMS_AGC	(1)
#define AW_PID_2013_RMSE_RMS_AGC_VALUE	\
	(AW_PID_2013_RMSE_RMS_AGC << AW_PID_2013_RMSE_START_BIT)

