LQM2015/stm32/Drivers/aw882xx/product_init_files/AW88266/aw882xx_pid_2013_reg.h
#define AW_PID_2013_RMSE_DEFAULT_VALUE	(0)
#define AW_PID_2013_RMSE_DEFAULT	\
	(AW_PID_2013_RMSE_DEFAULT_VALUE << AW_PID_2013_RMSE_START_BIT)

/* HAGCE bit 10 (SYSCTRL 0x04) */
#define AW_PID_2013_HAGCE_START_BIT	(10)
#define AW_PID_2013_HAGCE_BITS_LEN	(1)
#define AW_PID_2013_HAGCE_MASK	\
	(~(((1<<AW_PID_2013_HAGCE_BITS_LEN)-1) << AW_PID_2013_HAGCE_START_BIT))

#define AW_PID_2013_HAGCE_DISABLE	(0)
#define AW_PID_2013_HAGCE_DISABLE_VALUE	\
	(AW_PID_2013_HAGCE_DISABLE << AW_PID_2013_HAGCE_START_BIT)

#define AW_PID_2013_HAGCE_ENABLE	(1)
#define AW_PID_2013_HAGCE_ENABLE_VALUE	\
	(AW_PID_2013_HAGCE_ENABLE << AW_PID_2013_HAGCE_START_BIT)

#define AW_PID_2013_HAGCE_DEFAULT_VALUE	(0)
#define AW_PID_2013_HAGCE_DEFAULT	\
	(AW_PID_2013_HAGCE_DEFAULT_VALUE << AW_PID_2013_HAGCE_START_BIT)

/* HDCCE bit 9 (SYSCTRL 0x04) */
#define AW_PID_2013_HDCCE_START_BIT	(9)
#define AW_PID_2013_HDCCE_BITS_LEN	(1)
#define AW_PID_2013_HDCCE_MASK	\
	(~(((1<<AW_PID_2013_HDCCE_BITS_LEN)-1) << AW_PID_2013_HDCCE_START_BIT))

#define AW_PID_2013_HDCCE_DISABLE	(0)
#define AW_PID_2013_HDCCE_DISABLE_VALUE	\
	(AW_PID_2013_HDCCE_DISABLE << AW_PID_2013_HDCCE_START_BIT)

#define AW_PID_2013_HDCCE_ENABLE	(1)
#define AW_PID_2013_HDCCE_ENABLE_VALUE	\
	(AW_PID_2013_HDCCE_ENABLE << AW_PID_2013_HDCCE_START_BIT)

#define AW_PID_2013_HDCCE_DEFAULT_VALUE	(1)
#define AW_PID_2013_HDCCE_DEFAULT	\
	(AW_PID_2013_HDCCE_DEFAULT_VALUE << AW_PID_2013_HDCCE_START_BIT)

/* HMUTE bit 8 (SYSCTRL 0x04) */
#define AW_PID_2013_HMUTE_START_BIT	(8)
#define AW_PID_2013_HMUTE_BITS_LEN	(1)
#define AW_PID_2013_HMUTE_MASK	\
	(~(((1<<AW_PID_2013_HMUTE_BITS_LEN)-1) << AW_PID_2013_HMUTE_START_BIT))

#define AW_PID_2013_HMUTE_DISABLE	(0)
#define AW_PID_2013_HMUTE_DISABLE_VALUE	\
	(AW_PID_2013_HMUTE_DISABLE << AW_PID_2013_HMUTE_START_BIT)

#define AW_PID_2013_HMUTE_ENABLE	(1)
#define AW_PID_2013_HMUTE_ENABLE_VALUE	\
	(AW_PID_2013_HMUTE_ENABLE << AW_PID_2013_HMUTE_START_BIT)

#define AW_PID_2013_HMUTE_DEFAULT_VALUE	(1)
#define AW_PID_2013_HMUTE_DEFAULT	\
	(AW_PID_2013_HMUTE_DEFAULT_VALUE << AW_PID_2013_HMUTE_START_BIT)

/* EN_TRAN bit 7 (SYSCTRL 0x04) */
#define AW_PID_2013_EN_TRAN_START_BIT	(7)
#define AW_PID_2013_EN_TRAN_BITS_LEN	(1)
#define AW_PID_2013_EN_TRAN_MASK	\
	(~(((1<<AW_PID_2013_EN_TRAN_BITS_LEN)-1) << AW_PID_2013_EN_TRAN_START_BIT))

#define AW_PID_2013_EN_TRAN_SPK	(0)
#define AW_PID_2013_EN_TRAN_SPK_VALUE	\
	(AW_PID_2013_EN_TRAN_SPK << AW_PID_2013_EN_TRAN_START_BIT)

#define AW_PID_2013_EN_TRAN_RCV	(1)
#define AW_PID_2013_EN_TRAN_RCV_VALUE	\
	(AW_PID_2013_EN_TRAN_RCV << AW_PID_2013_EN_TRAN_START_BIT)

#define AW_PID_2013_EN_TRAN_DEFAULT_VALUE	(0)
#define AW_PID_2013_EN_TRAN_DEFAULT	\
	(AW_PID_2013_EN_TRAN_DEFAULT_VALUE << AW_PID_2013_EN_TRAN_START_BIT)

/* I2SEN bit 6 (SYSCTRL 0x04) */
#define AW_PID_2013_I2SEN_START_BIT	(6)
#define AW_PID_2013_I2SEN_BITS_LEN	(1)
#define AW_PID_2013_I2SEN_MASK	\
	(~(((1<<AW_PID_2013_I2SEN_BITS_LEN)-1) << AW_PID_2013_I2SEN_START_BIT))

#define AW_PID_2013_I2SEN_DISABLE	(0)
#define AW_PID_2013_I2SEN_DISABLE_VALUE	\
	(AW_PID_2013_I2SEN_DISABLE << AW_PID_2013_I2SEN_START_BIT)

#define AW_PID_2013_I2SEN_ENABLE	(1)
#define AW_PID_2013_I2SEN_ENABLE_VALUE	\
	(AW_PID_2013_I2SEN_ENABLE << AW_PID_2013_I2SEN_START_BIT)

#define AW_PID_2013_I2SEN_DEFAULT_VALUE	(0)
#define AW_PID_2013_I2SEN_DEFAULT	\
	(AW_PID_2013_I2SEN_DEFAULT_VALUE << AW_PID_2013_I2SEN_START_BIT)

/* WSINV bit 5 (SYSCTRL 0x04) */
#define AW_PID_2013_WSINV_START_BIT	(5)
#define AW_PID_2013_WSINV_BITS_LEN	(1)
#define AW_PID_2013_WSINV_MASK	\
	(~(((1<<AW_PID_2013_WSINV_BITS_LEN)-1) << AW_PID_2013_WSINV_START_BIT))

#define AW_PID_2013_WSINV_NOT_SWITCH	(0)
#define AW_PID_2013_WSINV_NOT_SWITCH_VALUE	\
	(AW_PID_2013_WSINV_NOT_SWITCH << AW_PID_2013_WSINV_START_BIT)

#define AW_PID_2013_WSINV_SWITCH	(1)
#define AW_PID_2013_WSINV_SWITCH_VALUE	\
	(AW_PID_2013_WSINV_SWITCH << AW_PID_2013_WSINV_START_BIT)

#define AW_PID_2013_WSINV_DEFAULT_VALUE	(0)
#define AW_PID_2013_WSINV_DEFAULT	\
	(AW_PID_2013_WSINV_DEFAULT_VALUE << AW_PID_2013_WSINV_START_BIT)

/* BCKINV bit 4 (SYSCTRL 0x04) */
#define AW_PID_2013_BCKINV_START_BIT	(4)
#define AW_PID_2013_BCKINV_BITS_LEN	(1)
#define AW_PID_2013_BCKINV_MASK	\
	(~(((1<<AW_PID_2013_BCKINV_BITS_LEN)-1) << AW_PID_2013_BCKINV_START_BIT))

#define AW_PID_2013_BCKINV_NOT_INVERT	(0)
#define AW_PID_2013_BCKINV_NOT_INVERT_VALUE	\
	(AW_PID_2013_BCKINV_NOT_INVERT << AW_PID_2013_BCKINV_START_BIT)

#define AW_PID_2013_BCKINV_INVERTED	(1)
#define AW_PID_2013_BCKINV_INVERTED_VALUE	\
	(AW_PID_2013_BCKINV_INVERTED << AW_PID_2013_BCKINV_START_BIT)

#define AW_PID_2013_BCKINV_DEFAULT_VALUE	(0)
#define AW_PID_2013_BCKINV_DEFAULT	\
	(AW_PID_2013_BCKINV_DEFAULT_VALUE << AW_PID_2013_BCKINV_START_BIT)

/* IPLL bit 3 (SYSCTRL 0x04) */
#define AW_PID_2013_IPLL_START_BIT	(3)
#define AW_PID_2013_IPLL_BITS_LEN	(1)
#define AW_PID_2013_IPLL_MASK	\
	(~(((1<<AW_PID_2013_IPLL_BITS_LEN)-1) << AW_PID_2013_IPLL_START_BIT))

#define AW_PID_2013_IPLL_BCK	(0)
#define AW_PID_2013_IPLL_BCK_VALUE	\
	(AW_PID_2013_IPLL_BCK << AW_PID_2013_IPLL_START_BIT)

#define AW_PID_2013_IPLL_WCK	(1)
#define AW_PID_2013_IPLL_WCK_VALUE	\
	(AW_PID_2013_IPLL_WCK << AW_PID_2013_IPLL_START_BIT)

#define AW_PID_2013_IPLL_DEFAULT_VALUE	(0)
#define AW_PID_2013_IPLL_DEFAULT	\
	(AW_PID_2013_IPLL_DEFAULT_VALUE << AW_PID_2013_IPLL_START_BIT)

/* AMPPD bit 1 (SYSCTRL 0x04) */
#define AW_PID_2013_AMPPD_START_BIT	(1)
#define AW_PID_2013_AMPPD_BITS_LEN	(1)
#define AW_PID_2013_AMPPD_MASK	\
	(~(((1<<AW_PID_2013_AMPPD_BITS_LEN)-1) << AW_PID_2013_AMPPD_START_BIT))

#define AW_PID_2013_AMPPD_WORKING	(0)
#define AW_PID_2013_AMPPD_WORKING_VALUE	\
	(AW_PID_2013_AMPPD_WORKING << AW_PID_2013_AMPPD_START_BIT)

#define AW_PID_2013_AMPPD_POWER_DOWN	(1)
#define AW_PID_2013_AMPPD_POWER_DOWN_VALUE	\
	(AW_PID_2013_AMPPD_POWER_DOWN << AW_PID_2013_AMPPD_START_BIT)

#define AW_PID_2013_AMPPD_DEFAULT_VALUE	(1)
#define AW_PID_2013_AMPPD_DEFAULT	\
	(AW_PID_2013_AMPPD_DEFAULT_VALUE << AW_PID_2013_AMPPD_START_BIT)

/* PWDN bit 0 (SYSCTRL 0x04) */
#define AW_PID_2013_PWDN_START_BIT	(0)
#define AW_PID_2013_PWDN_BITS_LEN	(1)
#define AW_PID_2013_PWDN_MASK	\
	(~(((1<<AW_PID_2013_PWDN_BITS_LEN)-1) << AW_PID_2013_PWDN_START_BIT))

#define AW_PID_2013_PWDN_WORKING	(0)
#define AW_PID_2013_PWDN_WORKING_VALUE	\
	(AW_PID_2013_PWDN_WORKING << AW_PID_2013_PWDN_START_BIT)

#define AW_PID_2013_PWDN_POWER_DOWN	(1)
#define AW_PID_2013_PWDN_POWER_DOWN_VALUE	\
	(AW_PID_2013_PWDN_POWER_DOWN << AW_PID_2013_PWDN_START_BIT)

