LQM2015/stm32/Drivers/aw882xx/product_init_files/AW88266/aw882xx_pid_2013_reg.h
#define AW_PID_2013_PWDN_DEFAULT_VALUE	(1)
#define AW_PID_2013_PWDN_DEFAULT	\
	(AW_PID_2013_PWDN_DEFAULT_VALUE << AW_PID_2013_PWDN_START_BIT)

/* default value of SYSCTRL (0x04) */
/* #define AW_PID_2013_SYSCTRL_DEFAULT		(0xD303) */

/* SYSCTRL2 (0x05) detail */
/* IV2CH bit 15 (SYSCTRL2 0x05) */
#define AW_PID_2013_IV2CH_START_BIT	(15)
#define AW_PID_2013_IV2CH_BITS_LEN	(1)
#define AW_PID_2013_IV2CH_MASK	\
	(~(((1<<AW_PID_2013_IV2CH_BITS_LEN)-1) << AW_PID_2013_IV2CH_START_BIT))

#define AW_PID_2013_IV2CH_LEGACY	(0)
#define AW_PID_2013_IV2CH_LEGACY_VALUE	\
	(AW_PID_2013_IV2CH_LEGACY << AW_PID_2013_IV2CH_START_BIT)

#define AW_PID_2013_IV2CH_SPECIAL	(1)
#define AW_PID_2013_IV2CH_SPECIAL_VALUE	\
	(AW_PID_2013_IV2CH_SPECIAL << AW_PID_2013_IV2CH_START_BIT)

#define AW_PID_2013_IV2CH_DEFAULT_VALUE	(0)
#define AW_PID_2013_IV2CH_DEFAULT	\
	(AW_PID_2013_IV2CH_DEFAULT_VALUE << AW_PID_2013_IV2CH_START_BIT)

/* I2SDOSEL bit 14 (SYSCTRL2 0x05) */
#define AW_PID_2013_I2SDOSEL_START_BIT	(14)
#define AW_PID_2013_I2SDOSEL_BITS_LEN	(1)
#define AW_PID_2013_I2SDOSEL_MASK	\
	(~(((1<<AW_PID_2013_I2SDOSEL_BITS_LEN)-1) << AW_PID_2013_I2SDOSEL_START_BIT))

#define AW_PID_2013_I2SDOSEL_ZEROS	(0)
#define AW_PID_2013_I2SDOSEL_ZEROS_VALUE	\
	(AW_PID_2013_I2SDOSEL_ZEROS << AW_PID_2013_I2SDOSEL_START_BIT)

#define AW_PID_2013_I2SDOSEL_TXDATA	(1)
#define AW_PID_2013_I2SDOSEL_TXDATA_VALUE	\
	(AW_PID_2013_I2SDOSEL_TXDATA << AW_PID_2013_I2SDOSEL_START_BIT)

#define AW_PID_2013_I2SDOSEL_DEFAULT_VALUE	(1)
#define AW_PID_2013_I2SDOSEL_DEFAULT	\
	(AW_PID_2013_I2SDOSEL_DEFAULT_VALUE << AW_PID_2013_I2SDOSEL_START_BIT)

/* DOHZ bit 13 (SYSCTRL2 0x05) */
#define AW_PID_2013_DOHZ_START_BIT	(13)
#define AW_PID_2013_DOHZ_BITS_LEN	(1)
#define AW_PID_2013_DOHZ_MASK	\
	(~(((1<<AW_PID_2013_DOHZ_BITS_LEN)-1) << AW_PID_2013_DOHZ_START_BIT))

#define AW_PID_2013_DOHZ_ALL	(0)
#define AW_PID_2013_DOHZ_ALL_VALUE	\
	(AW_PID_2013_DOHZ_ALL << AW_PID_2013_DOHZ_START_BIT)

#define AW_PID_2013_DOHZ_HIZ	(1)
#define AW_PID_2013_DOHZ_HIZ_VALUE	\
	(AW_PID_2013_DOHZ_HIZ << AW_PID_2013_DOHZ_START_BIT)

#define AW_PID_2013_DOHZ_DEFAULT_VALUE	(1)
#define AW_PID_2013_DOHZ_DEFAULT	\
	(AW_PID_2013_DOHZ_DEFAULT_VALUE << AW_PID_2013_DOHZ_START_BIT)

/* I2SCHS bit 12 (SYSCTRL2 0x05) */
#define AW_PID_2013_I2SCHS_START_BIT	(12)
#define AW_PID_2013_I2SCHS_BITS_LEN	(1)
#define AW_PID_2013_I2SCHS_MASK	\
	(~(((1<<AW_PID_2013_I2SCHS_BITS_LEN)-1) << AW_PID_2013_I2SCHS_START_BIT))

#define AW_PID_2013_I2SCHS_LEFT	(0)
#define AW_PID_2013_I2SCHS_LEFT_VALUE	\
	(AW_PID_2013_I2SCHS_LEFT << AW_PID_2013_I2SCHS_START_BIT)

#define AW_PID_2013_I2SCHS_RIGHT	(1)
#define AW_PID_2013_I2SCHS_RIGHT_VALUE	\
	(AW_PID_2013_I2SCHS_RIGHT << AW_PID_2013_I2SCHS_START_BIT)

#define AW_PID_2013_I2SCHS_DEFAULT_VALUE	(0)
#define AW_PID_2013_I2SCHS_DEFAULT	\
	(AW_PID_2013_I2SCHS_DEFAULT_VALUE << AW_PID_2013_I2SCHS_START_BIT)

/* INTMODE bit 11 (SYSCTRL2 0x05) */
#define AW_PID_2013_INTMODE_START_BIT	(11)
#define AW_PID_2013_INTMODE_BITS_LEN	(1)
#define AW_PID_2013_INTMODE_MASK	\
	(~(((1<<AW_PID_2013_INTMODE_BITS_LEN)-1) << AW_PID_2013_INTMODE_START_BIT))

#define AW_PID_2013_INTMODE_OPENMINUS_DRAIN	(0)
#define AW_PID_2013_INTMODE_OPENMINUS_DRAIN_VALUE	\
	(AW_PID_2013_INTMODE_OPENMINUS_DRAIN << AW_PID_2013_INTMODE_START_BIT)

#define AW_PID_2013_INTMODE_PUSHPULL	(1)
#define AW_PID_2013_INTMODE_PUSHPULL_VALUE	\
	(AW_PID_2013_INTMODE_PUSHPULL << AW_PID_2013_INTMODE_START_BIT)

#define AW_PID_2013_INTMODE_DEFAULT_VALUE	(0)
#define AW_PID_2013_INTMODE_DEFAULT	\
	(AW_PID_2013_INTMODE_DEFAULT_VALUE << AW_PID_2013_INTMODE_START_BIT)

/* INTN bit 10 (SYSCTRL2 0x05) */
#define AW_PID_2013_INTN_START_BIT	(10)
#define AW_PID_2013_INTN_BITS_LEN	(1)
#define AW_PID_2013_INTN_MASK	\
	(~(((1<<AW_PID_2013_INTN_BITS_LEN)-1) << AW_PID_2013_INTN_START_BIT))

#define AW_PID_2013_INTN_SYSINT	(0)
#define AW_PID_2013_INTN_SYSINT_VALUE	\
	(AW_PID_2013_INTN_SYSINT << AW_PID_2013_INTN_START_BIT)

#define AW_PID_2013_INTN_SYSST	(1)
#define AW_PID_2013_INTN_SYSST_VALUE	\
	(AW_PID_2013_INTN_SYSST << AW_PID_2013_INTN_START_BIT)

#define AW_PID_2013_INTN_DEFAULT_VALUE	(0)
#define AW_PID_2013_INTN_DEFAULT	\
	(AW_PID_2013_INTN_DEFAULT_VALUE << AW_PID_2013_INTN_START_BIT)

/* VOL bit 9:0 (SYSCTRL2 0x05) */
#define AW_PID_2013_VOL_START_BIT	(0)
#define AW_PID_2013_VOL_BITS_LEN	(10)
#define AW_PID_2013_VOL_MASK	\
	(~(((1<<AW_PID_2013_VOL_BITS_LEN)-1) << AW_PID_2013_VOL_START_BIT))

#define AW_PID_2013_MUTE_VOL	(90 * 8)
#define AW_PID_2013_VOL_STEP_DB	(6 * 8)

#define AW_PID_2013_VOL_DEFAULT_VALUE	(0)
#define AW_PID_2013_VOL_DEFAULT	\
	(AW_PID_2013_VOL_DEFAULT_VALUE << AW_PID_2013_VOL_START_BIT)

/* default value of SYSCTRL2 (0x05) */
/* #define AW_PID_2013_SYSCTRL2_DEFAULT		(0x6000) */

/* I2SCTRL1 (0x06) detail */
/* I2SRXEN bit 15 (I2SCTRL1 0x06) */
#define AW_PID_2013_I2SRXEN_START_BIT	(15)
#define AW_PID_2013_I2SRXEN_BITS_LEN	(1)
#define AW_PID_2013_I2SRXEN_MASK	\
	(~(((1<<AW_PID_2013_I2SRXEN_BITS_LEN)-1) << AW_PID_2013_I2SRXEN_START_BIT))

#define AW_PID_2013_I2SRXEN_DISABLE	(0)
#define AW_PID_2013_I2SRXEN_DISABLE_VALUE	\
	(AW_PID_2013_I2SRXEN_DISABLE << AW_PID_2013_I2SRXEN_START_BIT)

#define AW_PID_2013_I2SRXEN_ENABLE	(1)
#define AW_PID_2013_I2SRXEN_ENABLE_VALUE	\
	(AW_PID_2013_I2SRXEN_ENABLE << AW_PID_2013_I2SRXEN_START_BIT)

#define AW_PID_2013_I2SRXEN_DEFAULT_VALUE	(1)
#define AW_PID_2013_I2SRXEN_DEFAULT	\
	(AW_PID_2013_I2SRXEN_DEFAULT_VALUE << AW_PID_2013_I2SRXEN_START_BIT)

/* I2STXEN bit 14 (I2SCTRL1 0x06) */
#define AW_PID_2013_I2STXEN_START_BIT	(14)
#define AW_PID_2013_I2STXEN_BITS_LEN	(1)
#define AW_PID_2013_I2STXEN_MASK	\
	(~(((1<<AW_PID_2013_I2STXEN_BITS_LEN)-1) << AW_PID_2013_I2STXEN_START_BIT))

#define AW_PID_2013_I2STXEN_DISABLE	(0)
#define AW_PID_2013_I2STXEN_DISABLE_VALUE	\
	(AW_PID_2013_I2STXEN_DISABLE << AW_PID_2013_I2STXEN_START_BIT)

#define AW_PID_2013_I2STXEN_ENABLE	(1)
#define AW_PID_2013_I2STXEN_ENABLE_VALUE	\
	(AW_PID_2013_I2STXEN_ENABLE << AW_PID_2013_I2STXEN_START_BIT)

#define AW_PID_2013_I2STXEN_DEFAULT_VALUE	(0)
#define AW_PID_2013_I2STXEN_DEFAULT	\
	(AW_PID_2013_I2STXEN_DEFAULT_VALUE << AW_PID_2013_I2STXEN_START_BIT)

/* CFSEL bit 13:12 (I2SCTRL1 0x06) */
#define AW_PID_2013_CFSEL_START_BIT	(12)
#define AW_PID_2013_CFSEL_BITS_LEN	(2)
#define AW_PID_2013_CFSEL_MASK	\
	(~(((1<<AW_PID_2013_CFSEL_BITS_LEN)-1) << AW_PID_2013_CFSEL_START_BIT))

#define AW_PID_2013_CFSEL_HAGC	(0)
#define AW_PID_2013_CFSEL_HAGC_VALUE	\
	(AW_PID_2013_CFSEL_HAGC << AW_PID_2013_CFSEL_START_BIT)

#define AW_PID_2013_CFSEL_IV	(1)
#define AW_PID_2013_CFSEL_IV_VALUE	\
	(AW_PID_2013_CFSEL_IV << AW_PID_2013_CFSEL_START_BIT)

#define AW_PID_2013_CFSEL_IVT_IPVT	(2)
#define AW_PID_2013_CFSEL_IVT_IPVT_VALUE	\
	(AW_PID_2013_CFSEL_IVT_IPVT << AW_PID_2013_CFSEL_START_BIT)

#define AW_PID_2013_CFSEL_RESERVED	(3)
#define AW_PID_2013_CFSEL_RESERVED_VALUE	\
	(AW_PID_2013_CFSEL_RESERVED << AW_PID_2013_CFSEL_START_BIT)

#define AW_PID_2013_CFSEL_DEFAULT_VALUE	(0)
#define AW_PID_2013_CFSEL_DEFAULT	\
	(AW_PID_2013_CFSEL_DEFAULT_VALUE << AW_PID_2013_CFSEL_START_BIT)

