LQM2015/stm32/Drivers/aw882xx/product_init_files/AW88266/aw882xx_pid_2013_reg.h
#define AW_PID_2013_I2S_RXL_SLOTVLD_SLOT_3	(3)
#define AW_PID_2013_I2S_RXL_SLOTVLD_SLOT_3_VALUE	\
	(AW_PID_2013_I2S_RXL_SLOTVLD_SLOT_3 << AW_PID_2013_I2S_RXL_SLOTVLD_START_BIT)

#define AW_PID_2013_I2S_RXL_SLOTVLD_SLOT_4	(4)
#define AW_PID_2013_I2S_RXL_SLOTVLD_SLOT_4_VALUE	\
	(AW_PID_2013_I2S_RXL_SLOTVLD_SLOT_4 << AW_PID_2013_I2S_RXL_SLOTVLD_START_BIT)

#define AW_PID_2013_I2S_RXL_SLOTVLD_SLOT_5	(5)
#define AW_PID_2013_I2S_RXL_SLOTVLD_SLOT_5_VALUE	\
	(AW_PID_2013_I2S_RXL_SLOTVLD_SLOT_5 << AW_PID_2013_I2S_RXL_SLOTVLD_START_BIT)

#define AW_PID_2013_I2S_RXL_SLOTVLD_SLOT_6	(6)
#define AW_PID_2013_I2S_RXL_SLOTVLD_SLOT_6_VALUE	\
	(AW_PID_2013_I2S_RXL_SLOTVLD_SLOT_6 << AW_PID_2013_I2S_RXL_SLOTVLD_START_BIT)

#define AW_PID_2013_I2S_RXL_SLOTVLD_SLOT_15	(15)
#define AW_PID_2013_I2S_RXL_SLOTVLD_SLOT_15_VALUE	\
	(AW_PID_2013_I2S_RXL_SLOTVLD_SLOT_15 << AW_PID_2013_I2S_RXL_SLOTVLD_START_BIT)

#define AW_PID_2013_I2S_RXL_SLOTVLD_DEFAULT_VALUE	(0)
#define AW_PID_2013_I2S_RXL_SLOTVLD_DEFAULT	\
	(AW_PID_2013_I2S_RXL_SLOTVLD_DEFAULT_VALUE << AW_PID_2013_I2S_RXL_SLOTVLD_START_BIT)

/* default value of I2SCTRL2 (0x07) */
/* #define AW_PID_2013_I2SCTRL2_DEFAULT		(0x0010) */

/* DACCFG1 (0x08) detail */
/* RVTH bit 15:8 (DACCFG1 0x08) */
#define AW_PID_2013_RVTH_START_BIT	(8)
#define AW_PID_2013_RVTH_BITS_LEN	(8)
#define AW_PID_2013_RVTH_MASK	\
	(~(((1<<AW_PID_2013_RVTH_BITS_LEN)-1) << AW_PID_2013_RVTH_START_BIT))

#define AW_PID_2013_RVTH_DEFAULT_VALUE	(0x39)
#define AW_PID_2013_RVTH_DEFAULT	\
	(AW_PID_2013_RVTH_DEFAULT_VALUE << AW_PID_2013_RVTH_START_BIT)

/* AVTH bit 7:0 (DACCFG1 0x08) */
#define AW_PID_2013_AVTH_START_BIT	(0)
#define AW_PID_2013_AVTH_BITS_LEN	(8)
#define AW_PID_2013_AVTH_MASK	\
	(~(((1<<AW_PID_2013_AVTH_BITS_LEN)-1) << AW_PID_2013_AVTH_START_BIT))

#define AW_PID_2013_AVTH_DEFAULT_VALUE	(0x40)
#define AW_PID_2013_AVTH_DEFAULT	\
	(AW_PID_2013_AVTH_DEFAULT_VALUE << AW_PID_2013_AVTH_START_BIT)

/* default value of DACCFG1 (0x08) */
/* #define AW_PID_2013_DACCFG1_DEFAULT		(0x3940) */

/* DACCFG2 (0x09) detail */
/* ATTH bit 15:0 (DACCFG2 0x09) */
#define AW_PID_2013_ATTH_START_BIT	(0)
#define AW_PID_2013_ATTH_BITS_LEN	(16)
#define AW_PID_2013_ATTH_MASK	\
	(~(((1<<AW_PID_2013_ATTH_BITS_LEN)-1) << AW_PID_2013_ATTH_START_BIT))

#define AW_PID_2013_ATTH_RESERVED	(0)
#define AW_PID_2013_ATTH_RESERVED_VALUE	\
	(AW_PID_2013_ATTH_RESERVED << AW_PID_2013_ATTH_START_BIT)

#define AW_PID_2013_ATTH_DEFAULT_VALUE	(0x0030)
#define AW_PID_2013_ATTH_DEFAULT	\
	(AW_PID_2013_ATTH_DEFAULT_VALUE << AW_PID_2013_ATTH_START_BIT)

/* default value of DACCFG2 (0x09) */
/* #define AW_PID_2013_DACCFG2_DEFAULT		(0x0030) */

/* DACCFG3 (0x0A) detail */
/* RTTH bit 15:0 (DACCFG3 0x0A) */
#define AW_PID_2013_RTTH_START_BIT	(0)
#define AW_PID_2013_RTTH_BITS_LEN	(16)
#define AW_PID_2013_RTTH_MASK	\
	(~(((1<<AW_PID_2013_RTTH_BITS_LEN)-1) << AW_PID_2013_RTTH_START_BIT))

#define AW_PID_2013_RTTH_RESERVED	(0)
#define AW_PID_2013_RTTH_RESERVED_VALUE	\
	(AW_PID_2013_RTTH_RESERVED << AW_PID_2013_RTTH_START_BIT)

#define AW_PID_2013_RTTH_DEFAULT_VALUE	(0x01E0)
#define AW_PID_2013_RTTH_DEFAULT	\
	(AW_PID_2013_RTTH_DEFAULT_VALUE << AW_PID_2013_RTTH_START_BIT)

/* default value of DACCFG3 (0x0A) */
/* #define AW_PID_2013_DACCFG3_DEFAULT		(0x01E0) */

/* DACCFG4 (0x0B) detail */
/* IIC_GEN_ADDR bit 15:9 (DACCFG4 0x0B) */
#define AW_PID_2013_IIC_GEN_ADDR_START_BIT	(9)
#define AW_PID_2013_IIC_GEN_ADDR_BITS_LEN	(7)
#define AW_PID_2013_IIC_GEN_ADDR_MASK	\
	(~(((1<<AW_PID_2013_IIC_GEN_ADDR_BITS_LEN)-1) << AW_PID_2013_IIC_GEN_ADDR_START_BIT))

#define AW_PID_2013_IIC_GEN_ADDR_DEFAULT_VALUE	(0x0E)
#define AW_PID_2013_IIC_GEN_ADDR_DEFAULT	\
	(AW_PID_2013_IIC_GEN_ADDR_DEFAULT_VALUE << AW_PID_2013_IIC_GEN_ADDR_START_BIT)

/* IIC_GEN_EN bit 8 (DACCFG4 0x0B) */
#define AW_PID_2013_IIC_GEN_EN_START_BIT	(8)
#define AW_PID_2013_IIC_GEN_EN_BITS_LEN	(1)
#define AW_PID_2013_IIC_GEN_EN_MASK	\
	(~(((1<<AW_PID_2013_IIC_GEN_EN_BITS_LEN)-1) << AW_PID_2013_IIC_GEN_EN_START_BIT))

#define AW_PID_2013_IIC_GEN_EN_DISABLE	(0)
#define AW_PID_2013_IIC_GEN_EN_DISABLE_VALUE	\
	(AW_PID_2013_IIC_GEN_EN_DISABLE << AW_PID_2013_IIC_GEN_EN_START_BIT)

#define AW_PID_2013_IIC_GEN_EN_ENABLE	(1)
#define AW_PID_2013_IIC_GEN_EN_ENABLE_VALUE	\
	(AW_PID_2013_IIC_GEN_EN_ENABLE << AW_PID_2013_IIC_GEN_EN_START_BIT)

#define AW_PID_2013_IIC_GEN_EN_DEFAULT_VALUE	(0)
#define AW_PID_2013_IIC_GEN_EN_DEFAULT	\
	(AW_PID_2013_IIC_GEN_EN_DEFAULT_VALUE << AW_PID_2013_IIC_GEN_EN_START_BIT)

/* HOLDTH bit 7:0 (DACCFG4 0x0B) */
#define AW_PID_2013_HOLDTH_START_BIT	(0)
#define AW_PID_2013_HOLDTH_BITS_LEN	(8)
#define AW_PID_2013_HOLDTH_MASK	\
	(~(((1<<AW_PID_2013_HOLDTH_BITS_LEN)-1) << AW_PID_2013_HOLDTH_START_BIT))

#define AW_PID_2013_HOLDTH_RESERVED	(0)
#define AW_PID_2013_HOLDTH_RESERVED_VALUE	\
	(AW_PID_2013_HOLDTH_RESERVED << AW_PID_2013_HOLDTH_START_BIT)

#define AW_PID_2013_HOLDTH_DEFAULT_VALUE	(0x64)
#define AW_PID_2013_HOLDTH_DEFAULT	\
	(AW_PID_2013_HOLDTH_DEFAULT_VALUE << AW_PID_2013_HOLDTH_START_BIT)

/* default value of DACCFG4 (0x0B) */
/* #define AW_PID_2013_DACCFG4_DEFAULT		(0x1C64) */

/* DACST (0x20) detail */
/* SET_GAIN_ST bit 10:8 (DACST 0x20) */
#define AW_PID_2013_SET_GAIN_ST_START_BIT	(8)
#define AW_PID_2013_SET_GAIN_ST_BITS_LEN	(3)
#define AW_PID_2013_SET_GAIN_ST_MASK	\
	(~(((1<<AW_PID_2013_SET_GAIN_ST_BITS_LEN)-1) << AW_PID_2013_SET_GAIN_ST_START_BIT))

#define AW_PID_2013_SET_GAIN_ST_4P5_AV	(0)
#define AW_PID_2013_SET_GAIN_ST_4P5_AV_VALUE	\
	(AW_PID_2013_SET_GAIN_ST_4P5_AV << AW_PID_2013_SET_GAIN_ST_START_BIT)

#define AW_PID_2013_SET_GAIN_ST_5P0_AV	(1)
#define AW_PID_2013_SET_GAIN_ST_5P0_AV_VALUE	\
	(AW_PID_2013_SET_GAIN_ST_5P0_AV << AW_PID_2013_SET_GAIN_ST_START_BIT)

#define AW_PID_2013_SET_GAIN_ST_6P0_AV	(2)
#define AW_PID_2013_SET_GAIN_ST_6P0_AV_VALUE	\
	(AW_PID_2013_SET_GAIN_ST_6P0_AV << AW_PID_2013_SET_GAIN_ST_START_BIT)

#define AW_PID_2013_SET_GAIN_ST_6P7_AV	(3)
#define AW_PID_2013_SET_GAIN_ST_6P7_AV_VALUE	\
	(AW_PID_2013_SET_GAIN_ST_6P7_AV << AW_PID_2013_SET_GAIN_ST_START_BIT)

#define AW_PID_2013_SET_GAIN_ST_10_AV	(4)
#define AW_PID_2013_SET_GAIN_ST_10_AV_VALUE	\
	(AW_PID_2013_SET_GAIN_ST_10_AV << AW_PID_2013_SET_GAIN_ST_START_BIT)

#define AW_PID_2013_SET_GAIN_ST_12_AV	(5)
#define AW_PID_2013_SET_GAIN_ST_12_AV_VALUE	\
	(AW_PID_2013_SET_GAIN_ST_12_AV << AW_PID_2013_SET_GAIN_ST_START_BIT)

