LQM2015/stm32/Drivers/aw882xx/product_init_files/AW88266/aw882xx_pid_2013_reg.h
#define AW_PID_2013_SET_GAIN_ST_DEFAULT_VALUE	(5)
#define AW_PID_2013_SET_GAIN_ST_DEFAULT	\
	(AW_PID_2013_SET_GAIN_ST_DEFAULT_VALUE << AW_PID_2013_SET_GAIN_ST_START_BIT)

/* BSTVOUT_ST bit 3:0 (DACST 0x20) */
#define AW_PID_2013_BSTVOUT_ST_START_BIT	(0)
#define AW_PID_2013_BSTVOUT_ST_BITS_LEN	(4)
#define AW_PID_2013_BSTVOUT_ST_MASK	\
	(~(((1<<AW_PID_2013_BSTVOUT_ST_BITS_LEN)-1) << AW_PID_2013_BSTVOUT_ST_START_BIT))

#define AW_PID_2013_BSTVOUT_ST_3P25V	(0)
#define AW_PID_2013_BSTVOUT_ST_3P25V_VALUE	\
	(AW_PID_2013_BSTVOUT_ST_3P25V << AW_PID_2013_BSTVOUT_ST_START_BIT)

#define AW_PID_2013_BSTVOUT_ST_3P50V	(1)
#define AW_PID_2013_BSTVOUT_ST_3P50V_VALUE	\
	(AW_PID_2013_BSTVOUT_ST_3P50V << AW_PID_2013_BSTVOUT_ST_START_BIT)

#define AW_PID_2013_BSTVOUT_ST_3P75V	(2)
#define AW_PID_2013_BSTVOUT_ST_3P75V_VALUE	\
	(AW_PID_2013_BSTVOUT_ST_3P75V << AW_PID_2013_BSTVOUT_ST_START_BIT)

#define AW_PID_2013_BSTVOUT_ST_7P00V	(15)
#define AW_PID_2013_BSTVOUT_ST_7P00V_VALUE	\
	(AW_PID_2013_BSTVOUT_ST_7P00V << AW_PID_2013_BSTVOUT_ST_START_BIT)

#define AW_PID_2013_BSTVOUT_ST_DEFAULT_VALUE	(0)
#define AW_PID_2013_BSTVOUT_ST_DEFAULT	\
	(AW_PID_2013_BSTVOUT_ST_DEFAULT_VALUE << AW_PID_2013_BSTVOUT_ST_START_BIT)

/* default value of DACST (0x20) */
/* #define AW_PID_2013_DACST_DEFAULT		(0x0500) */

/* VBAT (0x21) detail */
/* VBAT_DET bit 9:0 (VBAT 0x21) */
#define AW_PID_2013_VBAT_DET_START_BIT	(0)
#define AW_PID_2013_VBAT_DET_BITS_LEN	(10)
#define AW_PID_2013_VBAT_DET_MASK	\
	(~(((1<<AW_PID_2013_VBAT_DET_BITS_LEN)-1) << AW_PID_2013_VBAT_DET_START_BIT))

#define AW_PID_2013_VBAT_DET_DEFAULT_VALUE	(0x263)
#define AW_PID_2013_VBAT_DET_DEFAULT	\
	(AW_PID_2013_VBAT_DET_DEFAULT_VALUE << AW_PID_2013_VBAT_DET_START_BIT)

/* default value of VBAT (0x21) */
/* #define AW_PID_2013_VBAT_DEFAULT		(0x0263) */

/* TEMP (0x22) detail */
/* TEMP_DET bit 9:0 (TEMP 0x22) */
#define AW_PID_2013_TEMP_DET_START_BIT	(0)
#define AW_PID_2013_TEMP_DET_BITS_LEN	(10)
#define AW_PID_2013_TEMP_DET_MASK	\
	(~(((1<<AW_PID_2013_TEMP_DET_BITS_LEN)-1) << AW_PID_2013_TEMP_DET_START_BIT))

#define AW_PID_2013_TEMP_DET_MINUS_40_DEGREE	(0x3D8)
#define AW_PID_2013_TEMP_DET_MINUS_40_DEGREE_VALUE	\
	(AW_PID_2013_TEMP_DET_MINUS_40_DEGREE << AW_PID_2013_TEMP_DET_START_BIT)

#define AW_PID_2013_TEMP_DET_0_DEGREE	(0x00)
#define AW_PID_2013_TEMP_DET_0_DEGREE_VALUE	\
	(AW_PID_2013_TEMP_DET_0_DEGREE << AW_PID_2013_TEMP_DET_START_BIT)

#define AW_PID_2013_TEMP_DET_1_DEGREE	(0x01)
#define AW_PID_2013_TEMP_DET_1_DEGREE_VALUE	\
	(AW_PID_2013_TEMP_DET_1_DEGREE << AW_PID_2013_TEMP_DET_START_BIT)

#define AW_PID_2013_TEMP_DET_25_DEGREE	(0x19)
#define AW_PID_2013_TEMP_DET_25_DEGREE_VALUE	\
	(AW_PID_2013_TEMP_DET_25_DEGREE << AW_PID_2013_TEMP_DET_START_BIT)

#define AW_PID_2013_TEMP_DET_55_DEGREE	(0x37)
#define AW_PID_2013_TEMP_DET_55_DEGREE_VALUE	\
	(AW_PID_2013_TEMP_DET_55_DEGREE << AW_PID_2013_TEMP_DET_START_BIT)

#define AW_PID_2013_TEMP_DET_DEFAULT_VALUE	(0x019)
#define AW_PID_2013_TEMP_DET_DEFAULT	\
	(AW_PID_2013_TEMP_DET_DEFAULT_VALUE << AW_PID_2013_TEMP_DET_START_BIT)

/* default value of TEMP (0x22) */
/* #define AW_PID_2013_TEMP_DEFAULT		(0x0019) */

/* PVDD (0x23) detail */
/* PVDD_DET bit 9:0 (PVDD 0x23) */
#define AW_PID_2013_PVDD_DET_START_BIT	(0)
#define AW_PID_2013_PVDD_DET_BITS_LEN	(10)
#define AW_PID_2013_PVDD_DET_MASK	\
	(~(((1<<AW_PID_2013_PVDD_DET_BITS_LEN)-1) << AW_PID_2013_PVDD_DET_START_BIT))

#define AW_PID_2013_PVDD_DET_DEFAULT_VALUE	(0x263)
#define AW_PID_2013_PVDD_DET_DEFAULT	\
	(AW_PID_2013_PVDD_DET_DEFAULT_VALUE << AW_PID_2013_PVDD_DET_START_BIT)

/* default value of PVDD (0x23) */
/* #define AW_PID_2013_PVDD_DEFAULT		(0x0263) */

/* CCO_MUX bit 2 (PLLCTRL3 0x55) */
#define AW_PID_2013_CCO_MUX_START_BIT	(2)
#define AW_PID_2013_CCO_MUX_BITS_LEN	(1)
#define AW_PID_2013_CCO_MUX_MASK		\
	(~(((1<<AW_PID_2013_CCO_MUX_BITS_LEN)-1) << AW_PID_2013_CCO_MUX_START_BIT))

#define AW_PID_2013_CCO_MUX_DIVIDED		(0)
#define AW_PID_2013_CCO_MUX_DIVIDED_VALUE	\
	(AW_PID_2013_CCO_MUX_DIVIDED << AW_PID_2013_CCO_MUX_START_BIT)

#define AW_PID_2013_CCO_MUX_BYPASS		(1)
#define AW_PID_2013_CCO_MUX_BYPASS_VALUE	\
	(AW_PID_2013_CCO_MUX_BYPASS << AW_PID_2013_CCO_MUX_START_BIT)

/* BSTCTRL1 (0x60) detail */
/* BURST_OVPCTR bit 15 (BSTCTRL1 0x60) */
#define AW_PID_2013_BURST_OVPCTR_START_BIT	(15)
#define AW_PID_2013_BURST_OVPCTR_BITS_LEN	(1)
#define AW_PID_2013_BURST_OVPCTR_MASK	\
	(~(((1<<AW_PID_2013_BURST_OVPCTR_BITS_LEN)-1) << AW_PID_2013_BURST_OVPCTR_START_BIT))

#define AW_PID_2013_BURST_OVPCTR_DISABLE	(0)
#define AW_PID_2013_BURST_OVPCTR_DISABLE_VALUE	\
	(AW_PID_2013_BURST_OVPCTR_DISABLE << AW_PID_2013_BURST_OVPCTR_START_BIT)

#define AW_PID_2013_BURST_OVPCTR_ENABLE	(1)
#define AW_PID_2013_BURST_OVPCTR_ENABLE_VALUE	\
	(AW_PID_2013_BURST_OVPCTR_ENABLE << AW_PID_2013_BURST_OVPCTR_START_BIT)

#define AW_PID_2013_BURST_OVPCTR_DEFAULT_VALUE	(1)
#define AW_PID_2013_BURST_OVPCTR_DEFAULT	\
	(AW_PID_2013_BURST_OVPCTR_DEFAULT_VALUE << AW_PID_2013_BURST_OVPCTR_START_BIT)

/* BST_RTH bit 13:8 (BSTCTRL1 0x60) */
#define AW_PID_2013_BST_RTH_START_BIT	(8)
#define AW_PID_2013_BST_RTH_BITS_LEN	(6)
#define AW_PID_2013_BST_RTH_MASK	\
	(~(((1<<AW_PID_2013_BST_RTH_BITS_LEN)-1) << AW_PID_2013_BST_RTH_START_BIT))

#define AW_PID_2013_BST_RTH_DEFAULT_VALUE	(4)
#define AW_PID_2013_BST_RTH_DEFAULT	\
	(AW_PID_2013_BST_RTH_DEFAULT_VALUE << AW_PID_2013_BST_RTH_START_BIT)

/* BST_ATH bit 5:0 (BSTCTRL1 0x60) */
#define AW_PID_2013_BST_ATH_START_BIT	(0)
#define AW_PID_2013_BST_ATH_BITS_LEN	(6)
#define AW_PID_2013_BST_ATH_MASK	\
	(~(((1<<AW_PID_2013_BST_ATH_BITS_LEN)-1) << AW_PID_2013_BST_ATH_START_BIT))

#define AW_PID_2013_BST_ATH_DEFAULT_VALUE	(2)
#define AW_PID_2013_BST_ATH_DEFAULT	\
	(AW_PID_2013_BST_ATH_DEFAULT_VALUE << AW_PID_2013_BST_ATH_START_BIT)

/* default value of BSTCTRL1 (0x60) */
/* #define AW_PID_2013_BSTCTRL1_DEFAULT		(0x8402) */

/* BSTCTRL2 (0x61) detail */
/* BST_VOUT6_SEL bit 15 (BSTCTRL2 0x61) */
#define AW_PID_2013_BST_VOUT6_SEL_START_BIT	(15)
#define AW_PID_2013_BST_VOUT6_SEL_BITS_LEN	(1)
#define AW_PID_2013_BST_VOUT6_SEL_MASK	\
	(~(((1<<AW_PID_2013_BST_VOUT6_SEL_BITS_LEN)-1) << AW_PID_2013_BST_VOUT6_SEL_START_BIT))

#define AW_PID_2013_BST_VOUT6_SEL_6P0V	(0)
#define AW_PID_2013_BST_VOUT6_SEL_6P0V_VALUE	\
	(AW_PID_2013_BST_VOUT6_SEL_6P0V << AW_PID_2013_BST_VOUT6_SEL_START_BIT)

#define AW_PID_2013_BST_VOUT6_SEL_6P1V	(1)
#define AW_PID_2013_BST_VOUT6_SEL_6P1V_VALUE	\
	(AW_PID_2013_BST_VOUT6_SEL_6P1V << AW_PID_2013_BST_VOUT6_SEL_START_BIT)

#define AW_PID_2013_BST_VOUT6_SEL_DEFAULT_VALUE	(0)
#define AW_PID_2013_BST_VOUT6_SEL_DEFAULT	\
	(AW_PID_2013_BST_VOUT6_SEL_DEFAULT_VALUE << AW_PID_2013_BST_VOUT6_SEL_START_BIT)

/* BST_IPEAK bit 14:12 (BSTCTRL2 0x61) */
#define AW_PID_2013_BST_IPEAK_START_BIT	(12)
#define AW_PID_2013_BST_IPEAK_BITS_LEN	(3)
#define AW_PID_2013_BST_IPEAK_MASK	\
	(~(((1<<AW_PID_2013_BST_IPEAK_BITS_LEN)-1) << AW_PID_2013_BST_IPEAK_START_BIT))

#define AW_PID_2013_BST_IPEAK_1P20A	(0)
#define AW_PID_2013_BST_IPEAK_1P20A_VALUE	\
	(AW_PID_2013_BST_IPEAK_1P20A << AW_PID_2013_BST_IPEAK_START_BIT)

#define AW_PID_2013_BST_IPEAK_1P40A	(1)
#define AW_PID_2013_BST_IPEAK_1P40A_VALUE	\
	(AW_PID_2013_BST_IPEAK_1P40A << AW_PID_2013_BST_IPEAK_START_BIT)

#define AW_PID_2013_BST_IPEAK_1P60A	(2)
#define AW_PID_2013_BST_IPEAK_1P60A_VALUE	\
	(AW_PID_2013_BST_IPEAK_1P60A << AW_PID_2013_BST_IPEAK_START_BIT)

#define AW_PID_2013_BST_IPEAK_1P80A	(3)
#define AW_PID_2013_BST_IPEAK_1P80A_VALUE	\
	(AW_PID_2013_BST_IPEAK_1P80A << AW_PID_2013_BST_IPEAK_START_BIT)

#define AW_PID_2013_BST_IPEAK_2P00A	(4)
#define AW_PID_2013_BST_IPEAK_2P00A_VALUE	\
	(AW_PID_2013_BST_IPEAK_2P00A << AW_PID_2013_BST_IPEAK_START_BIT)

#define AW_PID_2013_BST_IPEAK_2P25A	(5)
#define AW_PID_2013_BST_IPEAK_2P25A_VALUE	\
	(AW_PID_2013_BST_IPEAK_2P25A << AW_PID_2013_BST_IPEAK_START_BIT)

#define AW_PID_2013_BST_IPEAK_2P50A	(6)
#define AW_PID_2013_BST_IPEAK_2P50A_VALUE	\
	(AW_PID_2013_BST_IPEAK_2P50A << AW_PID_2013_BST_IPEAK_START_BIT)

