LQM2015/stm32/Drivers/aw882xx/product_init_files/AW88266/aw882xx_pid_2013_reg.h
#define AW_PID_2013_BST_IPEAK_2P75A	(7)
#define AW_PID_2013_BST_IPEAK_2P75A_VALUE	\
	(AW_PID_2013_BST_IPEAK_2P75A << AW_PID_2013_BST_IPEAK_START_BIT)

#define AW_PID_2013_BST_IPEAK_DEFAULT_VALUE	(6)
#define AW_PID_2013_BST_IPEAK_DEFAULT	\
	(AW_PID_2013_BST_IPEAK_DEFAULT_VALUE << AW_PID_2013_BST_IPEAK_START_BIT)

/* BST_TDEG bit 11:8 (BSTCTRL2 0x61) */
#define AW_PID_2013_BST_TDEG_START_BIT	(8)
#define AW_PID_2013_BST_TDEG_BITS_LEN	(4)
#define AW_PID_2013_BST_TDEG_MASK	\
	(~(((1<<AW_PID_2013_BST_TDEG_BITS_LEN)-1) << AW_PID_2013_BST_TDEG_START_BIT))

#define AW_PID_2013_BST_TDEG_0P50_MS	(0)
#define AW_PID_2013_BST_TDEG_0P50_MS_VALUE	\
	(AW_PID_2013_BST_TDEG_0P50_MS << AW_PID_2013_BST_TDEG_START_BIT)

#define AW_PID_2013_BST_TDEG_1P00_MS	(1)
#define AW_PID_2013_BST_TDEG_1P00_MS_VALUE	\
	(AW_PID_2013_BST_TDEG_1P00_MS << AW_PID_2013_BST_TDEG_START_BIT)

#define AW_PID_2013_BST_TDEG_2P00_MS	(2)
#define AW_PID_2013_BST_TDEG_2P00_MS_VALUE	\
	(AW_PID_2013_BST_TDEG_2P00_MS << AW_PID_2013_BST_TDEG_START_BIT)

#define AW_PID_2013_BST_TDEG_4P00_MS	(3)
#define AW_PID_2013_BST_TDEG_4P00_MS_VALUE	\
	(AW_PID_2013_BST_TDEG_4P00_MS << AW_PID_2013_BST_TDEG_START_BIT)

#define AW_PID_2013_BST_TDEG_8P00_MS	(4)
#define AW_PID_2013_BST_TDEG_8P00_MS_VALUE	\
	(AW_PID_2013_BST_TDEG_8P00_MS << AW_PID_2013_BST_TDEG_START_BIT)

#define AW_PID_2013_BST_TDEG_10P7_MS	(5)
#define AW_PID_2013_BST_TDEG_10P7_MS_VALUE	\
	(AW_PID_2013_BST_TDEG_10P7_MS << AW_PID_2013_BST_TDEG_START_BIT)

#define AW_PID_2013_BST_TDEG_13P3_MS	(6)
#define AW_PID_2013_BST_TDEG_13P3_MS_VALUE	\
	(AW_PID_2013_BST_TDEG_13P3_MS << AW_PID_2013_BST_TDEG_START_BIT)

#define AW_PID_2013_BST_TDEG_16P0_MS	(7)
#define AW_PID_2013_BST_TDEG_16P0_MS_VALUE	\
	(AW_PID_2013_BST_TDEG_16P0_MS << AW_PID_2013_BST_TDEG_START_BIT)

#define AW_PID_2013_BST_TDEG_18P6_MS	(8)
#define AW_PID_2013_BST_TDEG_18P6_MS_VALUE	\
	(AW_PID_2013_BST_TDEG_18P6_MS << AW_PID_2013_BST_TDEG_START_BIT)

#define AW_PID_2013_BST_TDEG_21P3_MS	(9)
#define AW_PID_2013_BST_TDEG_21P3_MS_VALUE	\
	(AW_PID_2013_BST_TDEG_21P3_MS << AW_PID_2013_BST_TDEG_START_BIT)

#define AW_PID_2013_BST_TDEG_24P0_MS	(10)
#define AW_PID_2013_BST_TDEG_24P0_MS_VALUE	\
	(AW_PID_2013_BST_TDEG_24P0_MS << AW_PID_2013_BST_TDEG_START_BIT)

#define AW_PID_2013_BST_TDEG_32P0_MS	(11)
#define AW_PID_2013_BST_TDEG_32P0_MS_VALUE	\
	(AW_PID_2013_BST_TDEG_32P0_MS << AW_PID_2013_BST_TDEG_START_BIT)

#define AW_PID_2013_BST_TDEG_64P0_MS	(12)
#define AW_PID_2013_BST_TDEG_64P0_MS_VALUE	\
	(AW_PID_2013_BST_TDEG_64P0_MS << AW_PID_2013_BST_TDEG_START_BIT)

#define AW_PID_2013_BST_TDEG_128_MS	(13)
#define AW_PID_2013_BST_TDEG_128_MS_VALUE	\
	(AW_PID_2013_BST_TDEG_128_MS << AW_PID_2013_BST_TDEG_START_BIT)

#define AW_PID_2013_BST_TDEG_256_MS	(14)
#define AW_PID_2013_BST_TDEG_256_MS_VALUE	\
	(AW_PID_2013_BST_TDEG_256_MS << AW_PID_2013_BST_TDEG_START_BIT)

#define AW_PID_2013_BST_TDEG_1200_MS	(15)
#define AW_PID_2013_BST_TDEG_1200_MS_VALUE	\
	(AW_PID_2013_BST_TDEG_1200_MS << AW_PID_2013_BST_TDEG_START_BIT)

#define AW_PID_2013_BST_TDEG_DEFAULT_VALUE	(11)
#define AW_PID_2013_BST_TDEG_DEFAULT	\
	(AW_PID_2013_BST_TDEG_DEFAULT_VALUE << AW_PID_2013_BST_TDEG_START_BIT)

/* BURST_FRE bit 7 (BSTCTRL2 0x61) */
#define AW_PID_2013_BURST_FRE_START_BIT	(7)
#define AW_PID_2013_BURST_FRE_BITS_LEN	(1)
#define AW_PID_2013_BURST_FRE_MASK	\
	(~(((1<<AW_PID_2013_BURST_FRE_BITS_LEN)-1) << AW_PID_2013_BURST_FRE_START_BIT))

#define AW_PID_2013_BURST_FRE_20KHZ	(0)
#define AW_PID_2013_BURST_FRE_20KHZ_VALUE	\
	(AW_PID_2013_BURST_FRE_20KHZ << AW_PID_2013_BURST_FRE_START_BIT)

#define AW_PID_2013_BURST_FRE_30KHZ	(1)
#define AW_PID_2013_BURST_FRE_30KHZ_VALUE	\
	(AW_PID_2013_BURST_FRE_30KHZ << AW_PID_2013_BURST_FRE_START_BIT)

#define AW_PID_2013_BURST_FRE_DEFAULT_VALUE	(0)
#define AW_PID_2013_BURST_FRE_DEFAULT	\
	(AW_PID_2013_BURST_FRE_DEFAULT_VALUE << AW_PID_2013_BURST_FRE_START_BIT)

/* RSQN_DLY_EN bit 6 (BSTCTRL2 0x61) */
#define AW_PID_2013_RSQN_DLY_EN_START_BIT	(6)
#define AW_PID_2013_RSQN_DLY_EN_BITS_LEN	(1)
#define AW_PID_2013_RSQN_DLY_EN_MASK	\
	(~(((1<<AW_PID_2013_RSQN_DLY_EN_BITS_LEN)-1) << AW_PID_2013_RSQN_DLY_EN_START_BIT))

#define AW_PID_2013_RSQN_DLY_EN_6NS	(0)
#define AW_PID_2013_RSQN_DLY_EN_6NS_VALUE	\
	(AW_PID_2013_RSQN_DLY_EN_6NS << AW_PID_2013_RSQN_DLY_EN_START_BIT)

#define AW_PID_2013_RSQN_DLY_EN_12NS	(1)
#define AW_PID_2013_RSQN_DLY_EN_12NS_VALUE	\
	(AW_PID_2013_RSQN_DLY_EN_12NS << AW_PID_2013_RSQN_DLY_EN_START_BIT)

#define AW_PID_2013_RSQN_DLY_EN_DEFAULT_VALUE	(0)
#define AW_PID_2013_RSQN_DLY_EN_DEFAULT	\
	(AW_PID_2013_RSQN_DLY_EN_DEFAULT_VALUE << AW_PID_2013_RSQN_DLY_EN_START_BIT)

/* BST_MODE bit 5:4 (BSTCTRL2 0x61) */
#define AW_PID_2013_BST_MODE_START_BIT	(4)
#define AW_PID_2013_BST_MODE_BITS_LEN	(2)
#define AW_PID_2013_BST_MODE_MASK	\
	(~(((1<<AW_PID_2013_BST_MODE_BITS_LEN)-1) << AW_PID_2013_BST_MODE_START_BIT))

#define AW_PID_2013_BST_MODE_TRANSPARENT	(0)
#define AW_PID_2013_BST_MODE_TRANSPARENT_VALUE	\
	(AW_PID_2013_BST_MODE_TRANSPARENT << AW_PID_2013_BST_MODE_START_BIT)

#define AW_PID_2013_BST_MODE_FORCE_BOOST	(1)
#define AW_PID_2013_BST_MODE_FORCE_BOOST_VALUE	\
	(AW_PID_2013_BST_MODE_FORCE_BOOST << AW_PID_2013_BST_MODE_START_BIT)

#define AW_PID_2013_BST_MODE_CLASS_G	(2)
#define AW_PID_2013_BST_MODE_CLASS_G_VALUE	\
	(AW_PID_2013_BST_MODE_CLASS_G << AW_PID_2013_BST_MODE_START_BIT)

#define AW_PID_2013_BST_MODE_CLASS_H	(3)
#define AW_PID_2013_BST_MODE_CLASS_H_VALUE	\
	(AW_PID_2013_BST_MODE_CLASS_H << AW_PID_2013_BST_MODE_START_BIT)

#define AW_PID_2013_BST_MODE_DEFAULT_VALUE	(0x3)
#define AW_PID_2013_BST_MODE_DEFAULT	\
	(AW_PID_2013_BST_MODE_DEFAULT_VALUE << AW_PID_2013_BST_MODE_START_BIT)

/* VOUT_VREFSET bit 3:0 (BSTCTRL2 0x61) */
#define AW_PID_2013_VOUT_VREFSET_START_BIT	(0)
#define AW_PID_2013_VOUT_VREFSET_BITS_LEN	(4)
#define AW_PID_2013_VOUT_VREFSET_MASK	\
	(~(((1<<AW_PID_2013_VOUT_VREFSET_BITS_LEN)-1) << AW_PID_2013_VOUT_VREFSET_START_BIT))

#define AW_PID_2013_VOUT_VREFSET_3P25V	(0)
#define AW_PID_2013_VOUT_VREFSET_3P25V_VALUE	\
	(AW_PID_2013_VOUT_VREFSET_3P25V << AW_PID_2013_VOUT_VREFSET_START_BIT)

#define AW_PID_2013_VOUT_VREFSET_3P50V	(1)
#define AW_PID_2013_VOUT_VREFSET_3P50V_VALUE	\
	(AW_PID_2013_VOUT_VREFSET_3P50V << AW_PID_2013_VOUT_VREFSET_START_BIT)

#define AW_PID_2013_VOUT_VREFSET_3P75V	(2)
#define AW_PID_2013_VOUT_VREFSET_3P75V_VALUE	\
	(AW_PID_2013_VOUT_VREFSET_3P75V << AW_PID_2013_VOUT_VREFSET_START_BIT)

#define AW_PID_2013_VOUT_VREFSET_4P00V	(3)
#define AW_PID_2013_VOUT_VREFSET_4P00V_VALUE	\
	(AW_PID_2013_VOUT_VREFSET_4P00V << AW_PID_2013_VOUT_VREFSET_START_BIT)

#define AW_PID_2013_VOUT_VREFSET_4P25V	(4)
#define AW_PID_2013_VOUT_VREFSET_4P25V_VALUE	\
	(AW_PID_2013_VOUT_VREFSET_4P25V << AW_PID_2013_VOUT_VREFSET_START_BIT)

#define AW_PID_2013_VOUT_VREFSET_4P50V	(5)
#define AW_PID_2013_VOUT_VREFSET_4P50V_VALUE	\
	(AW_PID_2013_VOUT_VREFSET_4P50V << AW_PID_2013_VOUT_VREFSET_START_BIT)

#define AW_PID_2013_VOUT_VREFSET_4P75V	(6)
#define AW_PID_2013_VOUT_VREFSET_4P75V_VALUE	\
	(AW_PID_2013_VOUT_VREFSET_4P75V << AW_PID_2013_VOUT_VREFSET_START_BIT)

#define AW_PID_2013_VOUT_VREFSET_5P00V	(7)
#define AW_PID_2013_VOUT_VREFSET_5P00V_VALUE	\
	(AW_PID_2013_VOUT_VREFSET_5P00V << AW_PID_2013_VOUT_VREFSET_START_BIT)

