LQM2015/stm32/Drivers/aw882xx/product_init_files/AW88266/aw882xx_pid_2013_reg.h
#define AW_PID_2013_VOUT_VREFSET_5P25V	(8)
#define AW_PID_2013_VOUT_VREFSET_5P25V_VALUE	\
	(AW_PID_2013_VOUT_VREFSET_5P25V << AW_PID_2013_VOUT_VREFSET_START_BIT)

#define AW_PID_2013_VOUT_VREFSET_5P50V	(9)
#define AW_PID_2013_VOUT_VREFSET_5P50V_VALUE	\
	(AW_PID_2013_VOUT_VREFSET_5P50V << AW_PID_2013_VOUT_VREFSET_START_BIT)

#define AW_PID_2013_VOUT_VREFSET_5P75V	(10)
#define AW_PID_2013_VOUT_VREFSET_5P75V_VALUE	\
	(AW_PID_2013_VOUT_VREFSET_5P75V << AW_PID_2013_VOUT_VREFSET_START_BIT)

#define AW_PID_2013_VOUT_VREFSET_6P00V	(11)
#define AW_PID_2013_VOUT_VREFSET_6P00V_VALUE	\
	(AW_PID_2013_VOUT_VREFSET_6P00V << AW_PID_2013_VOUT_VREFSET_START_BIT)

#define AW_PID_2013_VOUT_VREFSET_6P25V	(12)
#define AW_PID_2013_VOUT_VREFSET_6P25V_VALUE	\
	(AW_PID_2013_VOUT_VREFSET_6P25V << AW_PID_2013_VOUT_VREFSET_START_BIT)

#define AW_PID_2013_VOUT_VREFSET_6P50V	(13)
#define AW_PID_2013_VOUT_VREFSET_6P50V_VALUE	\
	(AW_PID_2013_VOUT_VREFSET_6P50V << AW_PID_2013_VOUT_VREFSET_START_BIT)

#define AW_PID_2013_VOUT_VREFSET_6P75V	(14)
#define AW_PID_2013_VOUT_VREFSET_6P75V_VALUE	\
	(AW_PID_2013_VOUT_VREFSET_6P75V << AW_PID_2013_VOUT_VREFSET_START_BIT)

#define AW_PID_2013_VOUT_VREFSET_7P00V	(15)
#define AW_PID_2013_VOUT_VREFSET_7P00V_VALUE	\
	(AW_PID_2013_VOUT_VREFSET_7P00V << AW_PID_2013_VOUT_VREFSET_START_BIT)

#define AW_PID_2013_VOUT_VREFSET_DEFAULT_VALUE	(0xB)
#define AW_PID_2013_VOUT_VREFSET_DEFAULT	\
	(AW_PID_2013_VOUT_VREFSET_DEFAULT_VALUE << AW_PID_2013_VOUT_VREFSET_START_BIT)

/* default value of BSTCTRL2 (0x61) */
/* #define AW_PID_2013_BSTCTRL2_DEFAULT		(0x6B3B) */

/* EF_ISN_GESLP bit 9:0 (EFRH 0x78) */
#define AW_PID_2013_EF_ISN_GESLP_START_BIT	(0)
#define AW_PID_2013_EF_ISN_GESLP_BITS_LEN	(10)
#define AW_PID_2013_EF_ISN_GESLP_MASK	\
	(~(((1<<AW_PID_2013_EF_ISN_GESLP_BITS_LEN)-1) << AW_PID_2013_EF_ISN_GESLP_START_BIT))

/* EF_VSN_GESLP bit 9:0 (EFRM2 0x79) */
#define AW_PID_2013_EF_VSN_GESLP_START_BIT	(0)
#define AW_PID_2013_EF_VSN_GESLP_BITS_LEN	(10)
#define AW_PID_2013_EF_VSN_GESLP_MASK	\
	(~(((1<<AW_PID_2013_EF_VSN_GESLP_BITS_LEN)-1) << AW_PID_2013_EF_VSN_GESLP_START_BIT))

/* detail information of registers end */
#define AW_PID_2013_EFVER_CHECK		(0x0007)
#define AW_PID_2013_EFVERH_START_BIT	(13)
#define AW_PID_2013_EFVERL_START_BIT	(10)

#define AW_PID_2013_EFVERH_MASK		(~(7 << 13))
#define AW_PID_2013_EFVERL_MASK		(~(7 << 10))
/********************************************
 * Volume Coefficient
 *******************************************/
#define AW_PID_2013_VOL_STEP		(6 * 8)

/********************************************
 * Vcalb
 *******************************************/
#define AW_PID_2013_EF_ISN_GESLP2_SIGN_MASK		(~0x0200)
#define AW_PID_2013_EF_ISN_GESLP2_NEG		(~0xFC00)

#define AW_PID_2013_EF_ISN_GESLP_SIGN_MASK		(~0x0200)
#define AW_PID_2013_EF_ISN_GESLP_NEG		(~0xFC00)

#define AW_PID_2013_CABL_BASE_VALUE			(1000)
#define AW_PID_2013_ICABLK_FACTOR			(1)
#define AW_PID_2013_VCABLK_FACTOR			(1)

#define AW_PID_2013_VCAL_FACTOR			(1<<13)

#define AW_PID_2013_MONITOR_VBAT_RANGE		(6025)
#define AW_PID_2013_MONITOR_INT_10BIT		(1023)
#define AW_PID_2013_MONITOR_TEMP_SIGN_MASK		(~(1<<9))
#define AW_PID_2013_MONITOR_TEMP_NEG_MASK		(0XFC00)

/********************************************
 * Dither
 *******************************************/
#define AW_PID_2013_DITHER_START_BIT	(14)
#define AW_PID_2013_DITHER_BITS_LEN	(1)
#define AW_PID_2013_DITHER_MASK	\
	(~(((1<<AW_PID_2013_DITHER_BITS_LEN)-1) << AW_PID_2013_DITHER_START_BIT))

#define AW_PID_2013_DITHER_DISABLE	(0)
#define AW_PID_2013_DITHER_DISABLE_VALUE	\
	(AW_PID_2013_DITHER_DISABLE << AW_PID_2013_DITHER_START_BIT)

#define AW_PID_2013_DITHER_ENABLE	(1)
#define AW_PID_2013_DITHER_ENABLE_VALUE	\
	(AW_PID_2013_DITHER_ENABLE << AW_PID_2013_DITHER_START_BIT)

#endif  /* #ifndef  __AW_PID_2013_REG_H__ */
